[
{"bathrooms_half": "", "date_listed": "2014-10-03 00:00:00", "mls_name": "CLAW", "price": "535000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "14799273", "rooms": [], "appliances": [], "street_address": "0 Castro Peak Mountainway", "description": "Enjoy amazing ocean and island views from this 10+ acre parcel situated in a convenient and peaceful area of the Santa Monica mountains. Just minutes from beaches or the 101, Castro Peak is located off of Latigo canyon in an area sprinkled with vineyards, ranches and horse properties. A paved road leads you to the site which features considerable useable land and multiple development areas. This is an area of new development. Build your dream."},
{"bathrooms_half": "", "date_listed": "2014-10-17 00:00:00", "mls_name": "CLAW", "price": "200000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "14802845", "rooms": [], "appliances": [], "street_address": "0 SADDLE PEAK RD", "description": "Spectacular views from this 4+ acre property perched on the ridge between PCH and the Valley. Two APNs - 4438-034-037 and 031 being sold together. Plus, there is a lot next door for sale too! A, paved private road leads you almost to the site. This lot has development challenges - not for the faint of heart. Property has been owned by the same family for over 40 years. Reports and information is limited."},
{"bathrooms_half": "", "date_listed": "2015-03-03 00:00:00", "mls_name": "CLAW", "price": "23500.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "15883387", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "21310 PACIFIC COAST HWY", "description": "A STUNNING Architectural beautifully designed with pillowed stone floors, hand rubbed Venetian plaster walls, 11 ft ceilings filled with natural light, theatrical mood lighting, 3 fireplaces, two huge ocean front decks - and the always sandy beach just about 13 minutes from Santa Monica. The Great Room has extensive seating, exquisite art, 2 huge antique barn doors as backdrop for the 65\" LED Smart TV (with 3D, wifi, surround sound) and is open to the European kitchen with service for 24. There are 2 Master Suites: one with private deck, steam shower, spa tub (all ocean front) & huge WIC , the 2nd Master has private entry, kitchenette, large sitting room and spa bath. The 3rd guest suite is as elegant and peaceful. Beautifully furnished with flat screens throughout, AC, 3 car garage and a guaranteed feeling of Serenity. June $30,000; Summer (July, Aug, Sept) at $45,000/mo."},
{"bathrooms_half": "", "date_listed": "2015-03-18 00:00:00", "mls_name": "CLAW", "price": "72500.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "15888095", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "23826 MALIBU RD", "description": "July & August not available. \"Captured in Paradise.\" Arguably on the most desired sandy beach of Malibu, this home-away-from-home offers a sophisticated zen ambiance & elegance at the beach. This private escape has a gated courtyard entry, which leads to an open dining/kitchen/living area, all stepping out to the private backyard with spa and expansive tanning deck. Inside are 4 bedrooms and 4.5 bathrooms, including a luxurious master suite. Complete with detached guest home and media room, this one-of-a-kind property was tastefully designed. Only a short jaunt to Malibu's finest shops, restaurants, and famous surf breaks, this rare offering is the perfect spot from which to enjoy Malibu's sunrises and sunsets. Available for long term furnished lease for $72,500/month"},
{"bathrooms_half": "", "date_listed": "2015-11-18 00:00:00", "mls_name": "CLAW", "price": "230000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "15959941", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "943 16th ST", "description": "Due to an overwhelming response we are no longer accepting applicants for this unit. We have an extensive list of candidates & new inquiries will not be returned. This unit is being strictly sold as required by the City of Santa Monica as the moderate-income unit for this new development per the Deed Restrictions imposed on the Unit. Owner must reside in unit (no leasing of unit is permitted). Any resale of the unit will be by same moderate income guidelines per the Deed Restrictions. Property is offered only to income approved purchasers as required by the City of Santa Monica's Moderate Income Guidelines per the Deed Restrictions. Purchase price is based on occupancy & depends on a formula. The formula used to calculate the purchase price for this unit is in the Deed Restriction. To be considered for this moderate income unit the maximum gross income is as follows per occupancy: 1 person -$59,800, 2 persons -$68,400, 3 persons -$76,900 & 4 persons -$85,400."},
{"bathrooms_half": "", "date_listed": "2015-12-11 00:00:00", "mls_name": "CLAW", "price": "2988000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "15965091", "rooms": [], "appliances": [], "street_address": "27061 SEA VISTA DR", "description": "Beautiful ocean and coastline views from this private lot situated off of PCH. Amazing views of the Point Dume cliffs with the opportunity to enjoy incredible sunsets without a long drive up a canyon. Also, being the last house on the street ensures maximum privacy. Currently there is an active Coastal Development Permit for development of a 7,366 square foot residence and pool. This is a fantastic opportunity to build a large custom estate in Malibu that is centrally located, close to the beach with deeded beach rights. So much hard work has been done!"},
{"bathrooms_half": "", "date_listed": "2016-03-16 00:00:00", "mls_name": "CLAW", "price": "25000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16106762", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "27086 MALIBU COVE COLONY DR", "description": "Gorgeous oceanfront home with views to Point Dume and direct beach access. This beach house is ideal for entertaining with a kitchen open to a great room and ocean front deck. Possible fourth bedroom or keep as den/TV room. Entry courtyard for barbecuing and entertaining. Bright and wonderful rooms, wood flooring. Available October 4th for short or long term."},
{"bathrooms_half": "", "date_listed": "2016-03-25 00:00:00", "mls_name": "CLAW", "price": "6500.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16109128", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "Built-In Gas", "Cooktop - Gas", "Double Oven", "Range Hood"], "street_address": "36 BREEZE AVE", "description": "his designer, custom architectural remodel on the charming Breeze walk-street is the epitome of luxurious and efficient living. Walls of warm reclaimed wood line the architectural interior, while expansive Nanawall doors open the living room to views of the Santa Monica Mountains. Equipped w/ a professional-grade entertainment system and wired Ethernet throughout the home. Enjoy the cook's kitchen with European conveniences such as new Viking & Miele appliances, as well as a spa-like master bathroom w/ custom granite, heated towel racks, steam shower & jet tub. The condo home also features in-unit laundry, 2 car dedicated garage parking w/ 3 bonus guest spots, & a rooftop deck w/ 360 views, bar, shaded cabana for ample entertainment. Just steps away from the beach, Abbot Kinney & the Boardwalk, this is Venice living at its core."},
{"bathrooms_half": "", "date_listed": "2016-04-12 00:00:00", "mls_name": "CLAW", "price": "5800000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16114818", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "31652 BROAD BEACH RD", "description": "Welcome to an oasis over looking the Pacific Ocean, where crashing waves and vivid sunsets create the quintessential Beach living environment. The controlled access exterior entry sets the tone for the elegance and sophistication that awaits you upon entering the residence. Built with style and taste, this contemporary villa offers great scale for avid art collectors and a casual, \"kick your shoes off\" environment to simply relax and enjoy the success you've created. Beyond the elegant main living room and entertainment spaces, prepare for the explosive, head on ocean views that beckon beyond banks of oversized French doors. The grand deck with fire pit, spa tub and dedicated access to the sand below creates one of the finest locations to enjoy one of Nature's true wonders. The master suite is ideally situated to take in the majestic views and with an oversized bath and large walk in closet; you'll realize that the layout has been carefully thought out."},
{"bathrooms_half": "", "date_listed": "2016-04-13 00:00:00", "mls_name": "CLAW", "price": "5499.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16115130", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "1912 KELTON AVE", "description": "Beautiful traditional Spanish in the heart of Westwood! Charming original details include high, vaulted ceilings in living room, cozy wood-burning fireplace, arched doorways, shelving alcoves, painted tile finishes and hardwood floors throughout. The convenient floor-plan features a bright and spacious living room and graciously-proportioned dining room that opens to quaint breakfast nook. Cheery kitchen boasts ample cabinet storage, counter space and opens to laundry room with door to driveway access for convenient grocery unloading. Three bedrooms plus bonus room that can be used as a bedroom, game room or home office. Central air and heat, two-car garage, additional driveway parking and flat, grassy backyard with mature citrus trees and small garden area. Westwood Charter School District, close proximity to local shops, restaurants, Century City Mall and convenient 405 and I-10 freeway access. Welcome Home!"},
{"bathrooms_half": "", "date_listed": "2016-04-14 00:00:00", "mls_name": "CLAW", "price": "798000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16115640", "rooms": [], "appliances": [], "street_address": "11258 Laurie Drive", "description": "NEW PROJECT - SHOVEL READY. *NOTE* This project has Ready To Issue (RTI) PERMITS because the Design Review Board has approved this development, for the Mulholland Scenic Parkway Corridor, in addition to ALL City Planning Departments. Set high above the hills of Studio City with sweeping unobstructed VIEWS and an expansive frontage of approx: 111 SF. This is a professionally designed Architectural 5-Bedroom contemporary home with APPROX: 4,370 SF (livable space) and a SWIMMING POOL Utilizing a warm material palette, this ultra sleek contemporary home demonstrates a clean comfortable aesthetic in a dramatic fashion. It is skillfully crafted to minimize scale and harmonize with the natural topography of the hills while maximizing square footage and ceiling heights. Beautifully designed this project is located on over 1/2 acre of land. Architectural Plans + Soils + Topography + Slope Band Analysis + Structural + Civil reports are ALL available upon request."},
{"bathrooms_half": "", "date_listed": "2016-04-25 00:00:00", "mls_name": "CLAW", "price": "6995000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16118008", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "RangeOven"], "street_address": "28011 PAQUET PL", "description": "Beautiful estate with panoramic ocean views located in the gated community of Ramirez Canyon. This 5 bed, 5 bath features an open floor plan with natural light and stunning ocean & mountain views throughout. The property features a gourmet kitchen, large master suite with views, grand entry which enters into a large bright living room. The property is situated in a magnificent setting nestled behind a private gated entrance with ample parking. A fantastic backyard, with spectacular ocean view pool & spa, a perfect home for entertaining. Being sold with the adjacent lot, combined the properties together are approximately over 5 and a half acres. The lot has picturesque ocean views and great development potential. This is an amazing opportunity!"},
{"bathrooms_half": "", "date_listed": "2016-05-06 00:00:00", "mls_name": "CLAW", "price": "6649000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16122648", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "6237 BONSALL DR", "description": "A prime flat ~1.5 acre lot w/ a unique use of modern finishes & innovative design by Vitus Matare. This private gated single story marvel is adorned w/ mature trees ranging from avocados to evergreens. The indoor/outdoor flow is seamless w/ spectacular outdoor features including 3 fire pits, an animal paddock, outdoor shower, raised garden beds, orchard & open lawn spaces. Upon entering it is easy to be overwhelmed by the use of steel, 70 year old hand hewn wood & radiant heat concrete flooring. This home exemplifies exceptional lines & ideal floorplan, high windows & use of petrified wood. Designed to be an entertainer's paradise. Located on one of Malibu's MOST desired streets w/ coveted underground access to Zuma Beach & state parkland for horse riding and hiking. In addition to the main residence there, is a 798 sq/ft detached garage/workshop, a detached bonus structure, and more. (Could be leased for $30,000/Month) Buyer to verify sq/ft."},
{"bathrooms_half": "", "date_listed": "2016-05-16 00:00:00", "mls_name": "CLAW", "price": "150000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16125100", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Microwave", "RangeOven"], "street_address": "0 BROAD BEACH RD", "description": "Unlike any other luxury opportunity, this beautiful Malibu compound offers a flat acre w/ over 120' of beach frontage; a lot depth extending 400'! A gated entrance, simple yet dignified, opens to a 2-story atrium corridor setting the tone for this grand estate. Designed by famed Edward Fickett, FAIA, this rare offering includes a tennis court, oceanside pool/spa, expansive lawns, patio areas & private parking for 10+ cars. This iconic home boasts oversized living spaces, high ceilings & abundant light with all bedrooms being en suite. The main floor includes dining room, bar, living, kitchen & large guest quarters. A curved staircase elegantly connects the ground level to the upper living areas including: dual oceanfront master suites, an ocean view bdrm, a bonus room, a grand wood-paneled family room w/ saloon; 2 additional bedrooms. Airy colors & furnishings renew tradition while the scale, combined w/ the unique amenities make it one of California's most unexpected delights."},
{"bathrooms_half": "", "date_listed": "2016-05-26 00:00:00", "mls_name": "CLAW", "price": "5975.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16129206", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "31341 BIRDELLA RD", "description": "Nestled in the heart of the Santa Monica Mountains, this serene setting invites you to hike, climb, or horseback ride throughout the day, then relax to the sounds of nature narrating the clear stellar night. Enter the 2-story foyer from the charming front porch to reveal open-plan living enveloped in natural light. On the first floor, you will enjoy living and family rooms with a fireplace, an open kitchen with dining area, and an office. French doors in both the family room and dining area open to patios in the private backyard for true indoor/outdoor living. Upstairs is the master suite with 2 huge walk-in closets and a proper bath with double vanity, spa tub with views, and a glass shower. Separated from the master suite, by a sound-insulated media room, are two additional bedrooms and a full bath. Less than 15-minutes from renowned beaches, shopping, and major freeways, this retreat is a convenient getaway from the hustle and bustle of the city."},
{"bathrooms_half": "", "date_listed": "2016-06-02 00:00:00", "mls_name": "CLAW", "price": "2450000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16130744", "rooms": [], "appliances": [], "street_address": "32036 PACIFIC COAST HWY", "description": "Build your Malibu dream home! Flat lot on almost one-half acre with pristine ocean views on the ocean side of PCH. Gated and private building site including deeded beach rights to one of the most beautiful beaches in Malibu just moments away. Existing barn included in the sale. Water meter on site and possible direct driveway from PCH or use community gate."},
{"bathrooms_half": "", "date_listed": "2016-06-05 00:00:00", "mls_name": "CLAW", "price": "2888000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16132084", "rooms": [], "appliances": [], "street_address": "888 Blackmore DR", "description": "This approx: 59 ACRE DEVELOPMENT SITE consists of SIX vacant lots. These lots sit on the back and the front side of a hill with a fire road running across the top part of the hill. The largest lot which is approx: 32 acres is located in the City of Glendale with the remaining 5 lots located in the City of Los Angeles. All SIX lots are zoned residential and are contiguous to one another. Accessibility is via Glenoaks Boulevard, Blackmore Drive or Sleepy Hollow Drive. Located in an urban in-fill pocket area, bounded and influenced on the North by the City of Glendale and on the South by the Eagle Rock section of Los Angeles. Pasadena lies directly to the east.The immediate area has an established mix of commercial and good quality residential development with easy access to both the Glendale, Ventura and Pasadena Freeways respectively.The entire site includes unsurpassed mountain, canyon and City light views all located within a dense thriving popular area of Los Angeles."},
{"bathrooms_half": "", "date_listed": "2016-06-06 00:00:00", "mls_name": "CLAW", "price": "27500.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16132158", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Microwave", "RangeOven"], "street_address": "19252 PACIFIC COAST HWY", "description": "Rare 98ft Ocean Front Classic Beauty reminiscent of glamorous days from a bygone era. Magnanimous rms paneled & floored w/ rain forest woods ooze casual elegance ala the Titanic. From the street you'll see 98ft of wall. Step thru the gate & garden patio then thru the paneled Foyer into the exquisite Great Rm. 'Wow' is your thought as you gaze across many beautiful settings for watching the fire blaze, chatting w/ friends, grabbing a drink at the bar. Down the hall find 3 luscious en-suite bedrms furnished as in fine European hotels (the Master is breathtaking). From the ocean front deck the visual feature is the entire Queen's necklace from Santa Monica (10 min away) to Palos Verdes to Catalina to Santa Barbara islands. Night time is a blaze of twinkling shoreline lights.The large outdoor dining & BBQ patio is perfect for Oceanside parties & offers a peaceful respite from evening breezes. Oh, & there's a Patio Casita for showering after your swim! This is a home you will never forget."},
{"bathrooms_half": "", "date_listed": "2016-07-15 00:00:00", "mls_name": "CLAW", "price": "1699000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16133142", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "1970 N GRAMERCY PL", "description": "Tranquility awaits at this 1935 Traditional hillside retreat in the coveted Los Feliz Oaks. Tucked away in a quiet cul-de-sac, this home boasts a dramatic living room with beamed ceilings, a decorative fireplace and a generous array of windows to welcome in the summer sunshine. Across the hall sits a cozy, wood-paneled office. The attached converted garage is a blank canvas: configure it as a game room, art studio, gym, or fourth bedroom. Just around the corner find an updated kitchen. The breakfast nook opens to a formal dining room, and French doors lead to the patio and sheltered grassy yard. Upstairs, the master bedroom is dramatic and roomy, with peekaboo views of the twinkling city lights. The second and third bedrooms share a Jack-and-Jill bath. Just outside, a spacious rooftop deck provides sweeping views of Hollywood and the hills: the perfect place to spend the evenings watching the sun descend into twilight."},
{"bathrooms_half": "", "date_listed": "2016-06-11 00:00:00", "mls_name": "CLAW", "price": "1498000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16134056", "rooms": [], "appliances": [], "street_address": "9229 Crescent Drive", "description": "High up in the Hollywood Hills, are 6 contiguous flat lots with Double Sided views, totaling approx: 17,400 SF. All 6 lots have superb views of both the City of Los Angeles AND Trousdale Estates. APN #'s are 5564-031-013 + 014 + 015 + 016 + 017 + 018 respectively. All 6 lots are fenced off and under lock and key. A Soils Reports is available upon request. *NOTE You need to drive past MLS# 16-132806 to get to 9229 Crescent Drive. Please see Agent Remarks for location of lots."},
{"bathrooms_half": "", "date_listed": "2016-06-14 00:00:00", "mls_name": "CLAW", "price": "1298000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16134704", "rooms": [], "appliances": [], "street_address": "2401 Laurel Canyon Boulevard", "description": "COMPOUND OPPORTUNITY HIDDEN IN PLAIN SIGHT.10 contiguous VACANT LOTS ONLY, (there is NO house) currently on this property totaling approx: 2.5 acres which includes an APPROX: 18,000 SF flat pad. Once the site of the 1960's/1970's strident pop iconoclast, Frank Zappa's legendary \"Log Cabin\" steeped in Rock and Roll history and home to Rock Royalty, this property was the premier gathering place of the 1960's/1970's Los Angeles Rock and Roll Scene because of it's proximity to the Troubador night club and the Sunset Strip. Built in 1915 as a massive log cabin tavern/roadhouse which burnt down in 1981 the property boasts sprawling park like grounds with 3 separate entrances. One entrance off Lookout Mountain and two entrances off Laurel Canyon Boulevard. All 10 vacant lots are zoned LARE15 and the property is in the Wonderland Elementary School District. A Soils Report is available upon request. *SELLER MAY CARRY*"},
{"bathrooms_half": "", "date_listed": "2016-06-14 00:00:00", "mls_name": "CLAW", "price": "1298000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16134756", "rooms": [], "appliances": [], "street_address": "24808 Woolsey Canyon RD", "description": "RESIDENTIAL DEVELOPMENT SITE: Consisting of 10 vacant lots on approx: 32 acres, with several BIG FLAT PADS and SWEEPING VALLEY VIEWS of San Fernando Valley, Warner Center and the Mountains. Reports are available upon request. Archaeological Report, Preliminary Geologic and Geo technical Engineering Feasibility Study, Environmental Report, Biological Constraints Analysis, Slope Study, SETAC Report, Lab Report and Woolsey Canyon Aerial Parcel Exhibit. Note* SELLER MAY CARRY*"},
{"bathrooms_half": "", "date_listed": "2016-06-16 00:00:00", "mls_name": "CLAW", "price": "1749000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16134906", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave", "Cooktop - Gas", "Oven-Gas"], "street_address": "386 ENTRADA DR", "description": "Location, location, location! Charming Mediterranean style home in the highly desirable Santa Monica Canyon. This home is customized throughout with a gourmet cooks kitchen with imported Italian granite walls, stainless steel appliances, and century-weathered wood cabinetry. Additionally, there are Brazilian hardwood floors through the house, an onyx mantel, recessed lighting, and more. This is perfect for an end user or as is or to develop and expand as well as nice size lot. Close to beach, restaurants, shopping and great schools. Hurry this will not last!"},
{"bathrooms_half": "", "date_listed": "2016-06-16 00:00:00", "mls_name": "CLAW", "price": "2195000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16135516", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "7350 PACIFIC VIEW DR", "description": "Perched above a cul-de-sac in the Hollywood Hills, this Dramatic newly constructed home is of the highest quality. Steel, concrete and glass with a clean modern aesthetic and a bright inviting atmosphere. Massive windows and walls of glass open to gorgeous views of mountains, lights, and the iconic Hollywood sign. The home seamlessly integrates with the outdoors with a sexy oversized spa with waterfall, fire-pit, outdoor barbecue and dining area as well as a huge upstairs outdoor patio. Exquisite interior finishes include French White Oak floors, European tile and Bosch appliances. This lovely home of integrity and supreme quality is a must see."},
{"bathrooms_half": "", "date_listed": "2016-07-06 00:00:00", "mls_name": "CLAW", "price": "17500000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16136820", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "RangeOven"], "street_address": "3464 SWEETWATER MESA RD", "description": "NEWLY PRICED TO SELL! Iconic Malibu living abounds in this architectural oasis atop a generous 4.25 acres within the exclusive Serra Retreat. Recently updated by a celebrated designer, the home offers approximately 8,000 square feet of coastal luxury featuring expansive whitewater ocean views from every room. Step through an enormous glass entryway into a foyer embraced by a grand curved staircase and meet light-drenched interior spaces with up to 20-foot ceilings. Behold a sparkling new state-of-the-art theater with a 12-foot screen. Five impeccably-detailed, light-infused bedroom suites flow flawlessly, each with designer baths and closets. The home's second grand staircase descends off a large second-level deck onto an open terrace with an oversized pool, waterfall, spa, outdoor kitchen and TV bar lounge. The estate also includes 12 private guest parking spaces and land suited for vineyards, tennis courts or a guest house."},
{"bathrooms_half": "", "date_listed": "2016-06-22 00:00:00", "mls_name": "CLAW", "price": "2035000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16137056", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave"], "street_address": "1422 SAN YSIDRO DR", "description": "Location,location,location. Located on one of BH's premier streets San Ysidro, this home is waiting for its next homeowner to put their magical touch on it. This home has 2 beds and 2 baths with an open floor plan perfect great for entertaining. Owner put in custom floors along with custom cooks kitchen and large master bedroom with bath. Outside is the deck perfect for summer bbq's. This home can be great for an end user or can be expanded and developed on even further. Hurry this will not last!"},
{"bathrooms_half": "", "date_listed": "2016-06-24 00:00:00", "mls_name": "CLAW", "price": "3195000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16137086", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "RangeOven"], "street_address": "6225 GAYTON PL", "description": "This beautiful 4 bedroom/4.5 bath is situated on approximately 1 acre with phenomenal mountain views in a tranquil setting and located in a gated community. The home offers a gourmet kitchen with granite counters, hardwood floors throughout, and a fireplace in living room with large picture windows. All bedrooms are en-suite, the master bed/bath is located on the 2nd floor with the remaining three beds located on the main floor. The grounds are lushly landscaped, pool/spa, outdoor fireplace, and a poolside cabana featuring BBQ. The garage has been turned into a bonus room and can easily be converted back to a three car garage. The property is walled and gated offering a secluded and quiet environment."},
{"bathrooms_half": "", "date_listed": "2016-07-06 00:00:00", "mls_name": "CLAW", "price": "34999.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16141262", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "1116 LINDA FLORA DR", "description": "Designed by renowned architect Walter Scott Perry in the classic modern Bauhaus tradition, this newly remodeled, 5 bedroom & 6 bathroom contemporary home is sited on a serene, half-acre knoll in Bel Air with sweeping unobstructed views of The Getty, Santa Monica, Catalina and Bel Air canyons. All interior and exterior spaces throughout the home have been thoughtfully transformed, incorporating the finest of timeless materials and finishes, while colors are used to great visual effect, beautifully enhancing the contemporary ambiance and impressive scale of the home by extending the interior outward and the exteriors inward.Rich in exquisite architectural detailing, the home overlooks resort-like grounds to present a secluded, tranquil environment perfect for entertaining and enjoying the outdoor amenities. All the while, resting in comfort and ease as this California Beauty sits atop 23 caissons!"},
{"bathrooms_half": "", "date_listed": "2016-07-11 00:00:00", "mls_name": "CLAW", "price": "20000000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16142180", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ"], "street_address": "2317 Dickenson RD", "description": "An hour outside of Los Angles with country and ocean views of Ojai sits Flying D Ranch. The ultimate ranch - surrounded by a seasonal creek and expansive terrain. Consisting of 1,281 acres and 7 parcels (7 parcels included sale (APN: 038-0-050-01; 038-0-050-02; 038-0-050-03; 038-0-050-14; 038-0-050-15; 038-0-050-16; 102-0-140-35), the ranch has 145 profitable acres of avocado and lemon agriculture and significant development/ water rights. The ranch's main residence, designed by famed architect Austen Pierpont, features beautiful views, and there is a barn & 3 other ranch-hand residences on property. The topography is diverse allowing for a multitude of uses - dude ranch, housing development, golf resort, luxury ranchettes, working ranch with vineyards or whatever you can imagine!"},
{"bathrooms_half": "", "date_listed": "2016-07-21 00:00:00", "mls_name": "CLAW", "price": "1399000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16142204", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas"], "street_address": "514 LILLIAN WAY", "description": "MOTIVATED SELLER! BRING US AN OFFER!! Perfectly situated between the Wilshire Country Club and the Los Angeles Tennis Club, come see this charming Spanish 3-bedroom house with central air and incredible guest house! 514 Lillian Way has been beautifully painted, floors, landscaping, and staged and is waiting for your final touches!"},
{"bathrooms_half": "", "date_listed": "2016-07-18 00:00:00", "mls_name": "CLAW", "price": "5495000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16144050", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "2600 Canada Este RD", "description": "CENT'ANNI Estate is an alluring 20 acre property amidst the picturesque countryside of Santa Ynez in the secluded, idyllic setting of Los Olivos. This is a once in a lifetime opportunity to acquire a So Calif 3 bed & 2 ba farmhouse vineyard estate w/ 3 bed & 1 ba caretaker's residence, a barrel barn housing high quality previous vintages aging in bottles & barrels awaiting release. The established & respected vine to wine operation is known for bottling 3 of the region's most notable wines - each poured by many of Los Angeles' top restaurants. The purchase of CENT'ANNI also includes Chambers & Chambers wine distribution & wine inventory worth $1.6 million+ (current FOB pricing), hilltop land ready for further development, access to the elite winemaker behind the brand, & dedicated Santa Barbara tasting room. CENT'ANNI is truly a success story ready to be handed to the next entrepreneur, romantic, or perhaps budding winemaker. It's your turn to enjoy the fruits of someone else's labor."},
{"bathrooms_half": "", "date_listed": "2016-07-21 00:00:00", "mls_name": "CLAW", "price": "10500000.00", "bedrooms": "7", "bathrooms_full": "", "mls_id": "16145020", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "602 PALISADES BEACH RD", "description": "Incredible opportunity to own this classic French Revival sitting on over 11,000 square feet of beach front land right in the middle of Santa Monica's famed Gold Coast. With 59 feet of beachfront, it is one of the largest single family lots north of the Santa Monica Pier to Will Roger's State Beach. The 5,000 square foot home has two different structures with a total of 7 bedrooms, 7 bathrooms. There is a 3-car garage and additional guest parking. The property is neighbored by single family homes, not parking lots. This is an exciting opportunity to create your own paradise along a premier stretch of coastline."},
{"bathrooms_half": "", "date_listed": "2016-07-22 00:00:00", "mls_name": "CLAW", "price": "468300.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16146358", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "4906 MENDOTA AVE", "description": "Amazing investor opportunity in hot, hot Highland Park. This is a Probate sale that requires court confirmation. Cash buyers only. Executor asks that you do not walk on property. No open houses, no showings. Drive by only."},
{"bathrooms_half": "", "date_listed": "2016-07-22 00:00:00", "mls_name": "CLAW", "price": "336900.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16146576", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "4017 E 6TH ST", "description": "There is an accepted offer at $308,500. The court confirmation hearing for the Sale is currently set for November 15, 2016 at 8:30 a.m. in Dept. 11 of Los Angeles County Superior Court located at 111 N. Hill Street, Los Angeles, California 90012. The minimum overbid amount is $314,925.00. The court will determine the amount of subsequent overbids (if any) will be."},
{"bathrooms_half": "", "date_listed": "2016-07-29 00:00:00", "mls_name": "CLAW", "price": "2688000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16148546", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Range Hood", "Microwave", "RangeOven"], "street_address": "29220 WAGON RD", "description": "Perched atop a secluded promontory, this inspired contemporary compound is located within the exclusive gated community of Medea Valley Estates, optimally positioned between Malibu and Agoura Hills. Offering unrivaled big sky vistas and enveloped by acres of mature greenery, this home presents a majestic setting to call home. Step through the stately two-story entry to an expansive view of the sun-drenched living room ahead, where the grandeur of the home's superior finishes are revealed. White wood paneling spanning both the walls and soaring ceilings meets the rich brown tones of the hardwood floors below, creating a stunning contrast as one moves throughout the generous spaces. Primed for the five-star lifestyle, the 2+ usable acre compound-consisting of 2 parcels is ideal for horses. The property also features an Ozone pool and spa with water features, an outdoor gazebo and alfresco dining area, a lighted tennis court with a pavilion, a dedicated gym and 3-car garage."},
{"bathrooms_half": "", "date_listed": "2016-08-05 00:00:00", "mls_name": "CLAW", "price": "1900000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16150042", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins"], "street_address": "29672 ZUMA BAY WAY", "description": "Impeccable townhome located in a 24-hour guard gated enclave known as Zuma Bay Villas. An amazing opportunity to call this your home, a turnkey investment, or a personal vacation escape with several private patios, extraordinary OCEAN VIEWS & attention to detail. Filled with light the main living level includes an open entry hallway with large living/dining room anchored by a wood-burning fireplace, sun patio. The kitchen comes complete with custom cabinetry, Wolf appliances, Italian tile floor, Italian glass backsplash & a garden patio for BBQ. The large master suite has unobstructed ocean views with patio & 3 closets (one full walk-in). Other favorite features include: wide-plank pine flooring, 100 bottle wine fridge & direct entry 2-car garage. The community includes open grass areas, heated salt-water pool, tennis, clubhouse, bountiful guest parking & most importantly a private/secure pathway leading down to Zuma/Westward beaches & the Sunset Restaurant."},
{"bathrooms_half": "", "date_listed": "2016-08-09 00:00:00", "mls_name": "CLAW", "price": "5540000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16150280", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "1961 DE MILLE DR", "description": "Beautiful architectural home with stunning 180 degree views from downtown to the ocean. This 6 bedroom 4.5 bath is tucked behind the highly desirable gates of the exclusive Laughlin Park Community. The main level has an open floorpan with a large living room and kitchen featuring floor to ceiling windows and pocket sliding doors for a indoor outdoor feel. The gourmet kitchen has double refrigerator, double sink, a walk in pantry, a chef's dream that is perfect for entertaining. The master suite is a true masterpiece with spectacular views, floor to ceiling pocket doors and a dream master bath, with a large tub and steam shower. This home features a, tranquil 'spa' like pool, large theater room, an office/bonus room and a second master suite. This is a exceptional home a must see!"},
{"bathrooms_half": "", "date_listed": "2016-08-05 00:00:00", "mls_name": "CLAW", "price": "20000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16150318", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave"], "street_address": "27112 MALIBU COVE COLONY DR", "description": "This sleek and sexy beach house is located on a private guard-gated lane in the center of Malibu. Upon entry, the home immediately introduces you to the Pacific Ocean with a two story entry, walls of glass and an open floorpan. The lower lever is ideal for entertaining with an ocean-front living room AND ocean-front family room complete with built-in bar. The indoor-outdoor flow is enhanced by the large decks perched above the waves. The kitchen overlooks the crashing surf and is designed for cooking ease. Also on the entry level is a private courtyard complete with built-in couches, fire pit and BBQ. All bedrooms are upstairs with the master and one additional being ocean front. The third bedroom has a large upper deck/patio area overlooking the courtyard. With approximately 70 feet of frontage on the sand to enjoy - the Malibu life starts here."},
{"bathrooms_half": "", "date_listed": "2016-08-05 00:00:00", "mls_name": "CLAW", "price": "10815.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16150758", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "181 SURFVIEW DR", "description": "Spectacular Contemporary with dramatic and architectural details. Exquisitely updated with fine attention to detail. Ocean view from most rooms, yard and decks. Gorgeous living/media room with bar area, stone fireplace and access to yard. Open family room off ultra-chic kitchen and dining area. Four bedrooms, Beautiful wood floors, arched windows with shutters, soaring ceilings, large skylight and more. One block to the beach! Close to Santa Monica and Malibu. Available furnished or unfurnished."},
{"bathrooms_half": "", "date_listed": "2016-08-11 00:00:00", "mls_name": "CLAW", "price": "3495000.00", "bedrooms": "7", "bathrooms_full": "", "mls_id": "16151208", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "Microwave", "RangeOven", "Convection Oven", "Cooktop - Gas", "Double Oven", "Gas", "Oven-Gas"], "street_address": "4960 VANALDEN AVE", "description": "Designed by noted architect Gus Duffy and situated on approx 3/4's of an acre, this resort like estate defines the meaning of \"compound\". The Casa: Is a single story 4+3.5 home, beautiful in rich wood finishes, limestone & granite featuring a huge gourmet cook's kitchen/family room & barrel ceiling living room. The round dining room w/vaulted ceiling is complimented by banks of French doors & the sumptuous master suite offers elegance & serenity. A Beautiful & inviting salt water swimmer's pool & oversized spa, plus outdoor living room w/vaulted ceilings, grand frplc & BBQ are the highlights of the expansive grounds. Gardens, fountains and exterior lighting accentuate this lush landscape. The Casita: at 2,178 sq ft, 2 stories and 3+2.5, is the full complement to the Casa. A great room w/approximately 22' soaring, beamed ceiling, a catering kitchen & powder room. Upstairs awaits a lavish mstr bdrm suite w/ full bath/tub & 2 additional bdrms & baths."},
{"bathrooms_half": "", "date_listed": "2016-08-10 00:00:00", "mls_name": "CLAW", "price": "3500.00", "bedrooms": "1", "bathrooms_full": "", "mls_id": "16151674", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "19355 PACIFIC COAST HWY", "description": "This charming, fully furnished 1 bedroom, 1 bath cottage sits on the grounds originally developed in the 1930's known as The Malibu Lodge. Truly a special property, across the street from Las Tunas State Beach and surrounded by open space. So close to Santa Monica while still living in Malibu"},
{"bathrooms_half": "", "date_listed": "2016-08-15 00:00:00", "mls_name": "CLAW", "price": "650000.00", "bedrooms": "1", "bathrooms_full": "", "mls_id": "16153228", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins"], "street_address": "7135 HOLLYWOOD", "description": "Hollywood Versailles Towers at it's best! Come see this hip, designer perfect condo in the fabulous, full-service building on Hollywood Boulevard! Bring your toothbrush and move in! This condo has a fabulous master suite replete with closets and palatial bathroom, state of the art kitchen, stunning views from living room, dining room and bedroom, open floor plan and is gorgeous! Bring us an offer!!! Priced to sell @ $699,000."},
{"bathrooms_half": "", "date_listed": "2016-08-22 00:00:00", "mls_name": "CLAW", "price": "12800000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16154748", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "9640 SIERRA HWY", "description": "Just 35 miles outside of Los Angeles, Agua Dulce Winery is a breathtaking 90-acre property affording oenophiles the rarity of owning a countryside estate featuring a spacious 5-bedroom residence and thriving, fully-operational wine business. Considered the largest vine-to-wine property in the region, Agua Dulce Winery produces award-winning wines from its prized 80~ acres of vines. It is a setting unlike any other in Southern California; a place that feels a world away yet conveniently accessible to travelers near and far. Sheltered by the rolling topography and surrounded by mountain vistas in every direction, the property's Colonial-style residence features a generous outdoor terrace and sweeping vineyard views, an idyllic space for entertaining or simply indulging in the luxurious vineyard lifestyle. With its tasting room, 2,000-member wine club, large event venue and use as a Hollywood filming location, Agua Dulce Winery is recognized as a prized destination in and of itself."},
{"bathrooms_half": "", "date_listed": "2016-08-30 00:00:00", "mls_name": "CLAW", "price": "10500.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16154856", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "6420 SYCAMORE MEADOWS DR", "description": "Modern Ranch Beach Bungalow in Sycamore Park. Located in idyllic Sycamore Park, steps from Escondido Beach, this light, airy, open home features vaulted whitewashed ceilings, hardwood floors, elegant lines & sophisticated architectural details. Designed with an indoor/outdoor experience in mind, this rare home captures the true essence of California Living. A warm & inviting great room leads to the cook's kitchen & outdoor dining area for grand entertaining. The large, private yard is a garden oasis with giant Sycamore, Avocado, and Fruit Trees. The home's natural flow, mountain views, sea breezes and close proximity to the ocean and beach creates a tranquil & visually stunning beach-side retreat."},
{"bathrooms_half": "", "date_listed": "2016-08-19 00:00:00", "mls_name": "CLAW", "price": "2288000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16154966", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "6410 SURFSIDE WAY", "description": "Located in one of Malibu's most desirable beachside neighborhoods, Malibu Park, this modern single-story home is styled with tranquil, Zen elements throughout. Close proximity to Zuma Beach, schools, shopping and Pacific Coast Highway make this neighborhood ideal for living the Malibu life. Upon entry to this paradise home, you are greeted by a large great room with a grand two story entrance and Arizona flagstone floors. An open dining area and exquisitely updated kitchen lead out to a courtyard area featuring a built in BBQ. The bedroom wing of the house features a private master with dog run and garden area outside of the French doors. Two additional private bedrooms with a spa-like bathroom round out the bedroom area. The backyard includes a flat grassy yard and detached garage with rooftop ocean deck. Situated at the end of a cul-de- sac and hidden behind a gated bamboo wall, this property grants total privacy."},
{"bathrooms_half": "", "date_listed": "2016-08-22 00:00:00", "mls_name": "CLAW", "price": "1719500.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16155556", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "RangeOven"], "street_address": "24014 PARK CASINO", "description": "Gorgeous home with view of Calabasas golf course, Located in the sought after Las Virgenes School District. Nice and bright with an impressive entryway with skylights that opens into the living room over looking the pool. Granite and marble floors throughout. The formal living room features a granite fireplace, vaulted ceiling, wet bar with stunning views of the mountains and Calabasas Country Club. The kitchen includes center island, breakfast nook and direct access to the formal dining room. The circular stairwell leading to the upstairs bedrooms offers stunning views of the pool and mountains. A beautiful master suite features a marble fireplace, sitting area and a private balcony with golf course views.The master bath has a relaxing jetted tub, dual sinks and large walk in closet. Great views from both the master and the second master suite of the mountains and Calabasas Country Club. Near the beautiful private Calabasas lake, tennis and swim center and Rick Caruso's The Commons."},
{"bathrooms_half": "", "date_listed": "2016-08-22 00:00:00", "mls_name": "CLAW", "price": "5700.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16155592", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "1100 N BEVERLY GLEN", "description": "Stunning Contemporary in Beverly Glen. Centrally located near Bel Air, Beverly Hills, Westwood, and Century City. The home has been tastefully updated with top quality finishes. Features hardwood floors, recessed lighting, double paned windows. Gourmet kitchen with granite countertops, center island, custom cabinetry and stainless steel Bosch appliances. Floor plan is flexible and includes 2 convertible dens that could be used as bedrooms. Top floor master suite with large walk-in closet, spacious sitting area or den opens to open patio with beautiful mountain and treetop views. This top floor suite includes a luxurious master bath with separate tub and shower, marble countertops and top-of-the-line bath fixtures. The lower level is an expansive family room/den with built-in speakers, recessed lighting and opens to a lovely rear brick patio; perfect for entertaining! Four available car parking spaces (2 inside the garage)."},
{"bathrooms_half": "", "date_listed": "2016-08-26 00:00:00", "mls_name": "CLAW", "price": "1450000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16156574", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "1016 OAKWOOD AVE", "description": "AMAZING OPPORTUNITY IN VENICE! Charming beach cottage with 3 bedrooms and one bathroom in main house. Hardwood floors, light and bright, spacious bathroom and laundry inside. Legal back studio with storage and laundry inside. Fenced in yard, studio/garage and adorable potting shed complete this fabulous property!"},
{"bathrooms_half": "", "date_listed": "2016-08-26 00:00:00", "mls_name": "CLAW", "price": "975000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16157052", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "5100 ANGELES VISTA BLVD", "description": "Classic 1928 Spanish Casa located in the desirable View Park enclave, recently designated in the National Registry of Historic Places."},
{"bathrooms_half": "", "date_listed": "2016-08-29 00:00:00", "mls_name": "CLAW", "price": "20000000.00", "bedrooms": "7", "bathrooms_full": "", "mls_id": "16157428", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "Microwave", "RangeOven", "Cooktop - Gas", "Double Oven"], "street_address": "200 TOYOPA DR", "description": "Perched atop the coveted Huntington area of the Pacific Palisades, this oceanside manor is nothing short of presidential - a rare composition of remarkable stonework flush with ivy and backlit by the crimson blue of the Pacific. Entering through wrought iron gates and a palatial motor court, one is greeted by a grand entry hall, guiding you into a medley of impeccably outfitted spaces; a light-drenched living room lined with french doors and crowned with contrasting dark vaulted ceilings, a royal oval dining room fit with hand-painted walls, a generous well-appointed kitchen and a paneled library. Retire to a large master suite with a terrace overlooking breathtaking views of Santa Monica Beach. Lush gardens and a verdant lawn frame the pool and spa terrace, a vast space suited for entertainment or respite. A prestigious edifice amidst the nationally-ranked school district of Huntington Palisades, this home is a bold statement of coastal living at its finest."},
{"bathrooms_half": "", "date_listed": "2016-09-02 00:00:00", "mls_name": "CLAW", "price": "10620000.00", "bedrooms": "8", "bathrooms_full": "", "mls_id": "16157766", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Microwave", "RangeOven"], "street_address": "16242 SHADOW MOUNTAIN DR", "description": "Shadow Mountain is an enclave of 46 wonderful estates that enjoy 24 hour live-gated security just minutes from all that Pacific Palisades has to offer. This spectacular property was conceived and custom built to recreate a comfortable and lovely chateau from the south of France. Set on over an acre with stunning ocean, hillside and vineyard views, 16242 Shadow Mt. enjoys a huge flat yard, a wonderful custom paved pool and a great sports court. The owners/builders imported antique and reclaimed tile, stone and pavers from France and generously and creatively added these beautiful and timeless finishes throughout the house. The house is nearly 9,000 sq. ft. and has high ceilings, oversized doorframes, walls of French doors and gracious places to relax with family and friends or host huge gatherings.The kitchen has it all and is a true chef's paradise with Viking appliances, wonderful work surfaces and 2 large farm sinks. There is an oversized 3 car garage and an electric charging station"},
{"bathrooms_half": "", "date_listed": "2016-08-30 00:00:00", "mls_name": "CLAW", "price": "2995000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16157850", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "RangeOven"], "street_address": "22042 CARBON MESA RD", "description": "68 yrs ago the owners picked this spot overlooking the now famous Billionaires' Beach in Malibu. This pastoral sanctuary, approx. 2.8 acres, has panoramic Ocean Views from Santa Monica's shoreline to Palos Verdes and Catalina?. Peaceful, Soulful and just \"what Malibu is all about.\" The Nantucket style main home has pitched beam ceilings, 3 Bedr/4 Bth, 3 fpl inside (plus one in the covered patio), a BBQ patio, big grassy lawn, and lg motor court. The separate Gst House has 2 bedr/1 bath and adjacent 2 car garage. The property has deeded rights to membership in the fabulous La Costa Beach and Tennis Club. Property needs TLC, the rewards will be well worth your efforts! Open Sunday( 11/13) 1-4pm and Thursday (11/17) 12-2pm Trustees will look at offers Nov. 18th"},
{"bathrooms_half": "", "date_listed": "2016-08-31 00:00:00", "mls_name": "CLAW", "price": "3169000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16158240", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "6420 SYCAMORE MEADOWS DR", "description": "Modern Ranch Beach Bungalow in idyllic Sycamore Park. Just steps from Escondido Beach, this light, airy, open home features vaulted whitewashed ceilings, hardwood floors, elegant lines & sophisticated architectural details. Designed with an indoor/outdoor experience in mind, this rare home captures the true essence of California Living. A warm & inviting great room leads to the cooks kitchen & outdoor dining area for grand entertaining. The large, private yard is a garden oasis with giant Sycamore, Avocado, and Fruit Trees. The home's natural flow, mountain views, sea breezes and close proximity to the ocean and beach creates a tranquil & visually stunning beach-side retreat. Less than a 5 min walk to Escondido Beach, this home is perfect for those seeking the Malibu beach life?. Whether it's sunset beach to Paradise Cove/Little Dume Beach or Surfing at Latigo this home offers the best of all worlds. Also available for Lease. Call for Details"},
{"bathrooms_half": "", "date_listed": "2016-09-06 00:00:00", "mls_name": "CLAW", "price": "1299000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16158556", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave"], "street_address": "3464 GREENWOOD AVE", "description": "Tropical Traditional on the Famed Mar Vista Wood Streets. A gated, grassy front yard welcomes you to 3 bed 2.5 bath home with a large office. Enjoy an updated kitchen with an oversized granite peninsula, breakfast bar and stainless steel appliances. Cozy back yard with an oversized 460 sqft 2-car garage with electronic gate access off of the alley. Master suite with walk-in closet and additional coat closet.Turn-key home in a wonderful neighborhood. Plans are available for a 2,429 sqft home designed by The Code Solution"},
{"bathrooms_half": "", "date_listed": "2016-09-02 00:00:00", "mls_name": "CLAW", "price": "720000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16158874", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "10747 WILSHIRE", "description": "Prime Wilshire corridor location! Secure building with a 24 hr. doorman. Light and bright luxury unit, the best bargain on the Wilshire corridor. 2 bdrm/ 2 bath updated condo with plantation shutters and recessed lighting. Stainless steel appliances in the kitchen and granite in the kitchen. A short distance to Westwood Village. Enjoy fabulous retaurants, retail shops, and places of worship. Perfect if you want to be near the UCLA campus or UCLA medical center."},
{"bathrooms_half": "", "date_listed": "2016-09-06 00:00:00", "mls_name": "CLAW", "price": "2400000.00", "bedrooms": "7", "bathrooms_full": "", "mls_id": "16159656", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven", "Built-In Gas", "Cooktop - Gas"], "street_address": "11647 BELLAGIO RD", "description": "Located on one of Bel Air's most coveted streets, this superb property provides an escape from city life to a sanctuary of treetop vistas and glorious views of the Getty Museum and Catalina Island on a clear day. This home suits many needs boasting over 4800 sq feet of spacious living with 7 bedrooms and great flow for entertaining. The large cooks kitchen is ideal for cooking with stainless steel appliances and granite counters and large island for conversations. While the home could be for an end user it also lends itself to a host of development opportunities to expand upon the lot and home.This is truly a home not to be missed!"},
{"bathrooms_half": "", "date_listed": "2016-09-08 00:00:00", "mls_name": "CLAW", "price": "3995000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16159808", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "RangeOven"], "street_address": "316 N SKYEWIAY RD", "description": "New Construction in the heart of Brentwood. This \"East Coast Beach Cottage\" influenced 5 bedroom, 5 bath home has a flexible open floorplan and works well for daily living and entertaining. The formal living room and dining room open onto the lovely entrance courtyard. The spacious kitchen with large island and eat-in area, is ideal for gatherings both small and large, and opens to the airy family room with views of the grassy yard. Top of the line appliances include a Wolf range, Sub Zero refrigerator and Bosch dishwasher. Upstairs spacious master suite has a roomy closet and a gorgeous spa like bath. Three additional bedrooms located upstairs- one of which would also function as a terrific upstairs family room or office. Great finishes and details throughout include French Oak floors, Walker Zanger and Ann Sacks tile and beautiful moldings. High ceilings, large windows, and glass doors flood the interiors with natural light. Outdoor fireplace and dining patio with peaceful views."},
{"bathrooms_half": "", "date_listed": "2016-09-09 00:00:00", "mls_name": "CLAW", "price": "2895000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16160058", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "545 CATALONIA AVE", "description": "An architectural wonder designed by renowned architect David Kellen, a student of Frank Israel and colleague of Frank Gehry, this neo-modern ranch is perched atop the rolling hills of Pacific Palisades. The awe-inspiring residence challenges the human experience, each individual space on the 16,000-foot lot contradicting the others in an unforeseen synergy. The home is infused w/ natural light by way of floor-to-ceiling and corner windows, allowing most of its airy interiors to observe commanding ocean, coastline, city and canyon views. Downstairs, two bedroom suites and a den each offer their own brazen character, opening to the pleasant backyard and swimming pool. The tower houses a third en-suite bedroom and a remarkable master suite by which to observe the world."},
{"bathrooms_half": "", "date_listed": "2016-09-08 00:00:00", "mls_name": "CLAW", "price": "5498000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16160314", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "RangeOven"], "street_address": "868 LEONARD RD", "description": "Thoughtfully placed on an idyllic Brentwood cul-de-sac, this newly constructed California Modern was beautifully conceived by Marmol Radziner to blend effortlessly into the hillside topography by way of native materials and flawless design. Like a luxurious shelter within an open-air resort, the central great room is framed by single-pane 11-foot sliding glass doors, affixing panoramas of the lush front courtyard and backyard oasis where the lap pool, spa, outdoor kitchen & fireplace lounge rest peacefully against a rolling hillside. The ground floor includes a state-of-the-art kitchen, dining room, separate caterer's kitchen, wine room, & guest suite with a private side entrance. Ascend to the second floor to find a luminous semi-private transitional lounge space & four bedrooms, each w/floor-to-ceiling windows & White Oak floors. Comprising a full lighting control system, hidden motorized window shades & a bounty of built-in cabinetry, this home is poised for effortless luxury living"},
{"bathrooms_half": "", "date_listed": "2016-09-09 00:00:00", "mls_name": "CLAW", "price": "450000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16161032", "rooms": [], "appliances": [], "street_address": "21425 Rambla Vista", "description": "This upslope lot in the desirable La Costa area of Malibu is located less than a minute off of PCH and is in close proximity to shopping, schools, and Santa Monica. Enjoy panoramic ocean and whitewater views from your future dream house which has already been approved in the past! In 1995 the property was issued a Coastal Development Permit and building permits but the home was never built. The current owner has the plans for a three bedroom approximately 2,300 S.F. home (not including the garage, decks and patios). Percolation, geological and soils reports available with some updates in 2008. This is a great opportunity to build the house you want in the center of Malibu! This property also allows membership to the private La Costa beach club - seller has kept dues up-to-date."},
{"bathrooms_half": "", "date_listed": "2016-09-10 00:00:00", "mls_name": "CLAW", "price": "7900.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16161068", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "7931 ZEUS DR", "description": "4 bedroom + 3.5 bathrooms, 3162 sqft home with pool on a 12,219 sqft lot. Cul-de-sac location, convenient to Sunset Strip, Hollywood and West Hollywood. Spacious Modern Spanish home with city views and ocean views from the private master bedroom patio. Master suite with views and large patio, two closets. Masterbath with 2 sinks. Two big second bedrooms and bath upstairs. First floor bedroom could be the perfect office. Nest heating and cooling system. Breakfast room, Dining Room with fireplace, stone wall, and bar. Living room with fireplace, vaulted ceilings and sliders to side yard. Wood flooring, carpet and tile. Side grassy yard. Pool and hot tub, with huge patio area. Two Car garage."},
{"bathrooms_half": "", "date_listed": "2016-09-14 00:00:00", "mls_name": "CLAW", "price": "2588000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16161388", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "1900 PETERSON AVE", "description": "Extraordinary view home located in the award-winning South Pasadena School district. Located minutes to Downtown LA, USC and Caltech. This home showcases stunning views of downtown, mountains & trees. Formal living and rm w/ breathtaking breezes & stunning sunsets. The heart of the home is the gourmet kitchen w/ center island, granite countertops & adjoining large lavish family rm, all of which open to the backyard for extended outdoor living. 1st floor bedrm suite is perfect for guests & downstairs bedrm, originally envisioned as maids quarters, offers endless possibilities. Stairwell w/ elegant crystal chandelier, which cascades from the two-story ceiling, leads you up to 4 corner bedrms, including master suite. Private driveway leads you up to a motor court & expansive 3 car garage. The lovely backyard inspires outdoor living and dining! Close to the Gold Line, schools, shopping and eateries. This castle-like home is an Oasis of Privacy and Luxury Living!"},
{"bathrooms_half": "", "date_listed": "2016-09-16 00:00:00", "mls_name": "CLAW", "price": "969000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16161666", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave", "RangeOven", "Oven"], "street_address": "10700 ARTRUDE ST", "description": "Located on a peaceful cul-de-sac in the lovely equestrian community of Shadow Hills, this extensively updated modern ranch home is the perfect turnkey opportunity. Upon entering this home, you are greeted by incredible natural light. The modern kitchen is equipped with custom cabinetry, stainless-steel appliances, and a breakfast bar. Attached to the kitchen is the dining room, which flows nicely into the family room, overlooking the pool and cabana. The master suite opens onto the backyard and features a barn-door leading to the master walk-in closet and freshly tiled bathroom. The additional three bedrooms are spacious, each with a large closet. The bathroom servicing these bedrooms has a custom-tiled shower, modern bathtub, and rustic double vanity. The spacious backyard currently has a pool and a cabana, but the layout easily allows for an outdoor dining area and an entertaining space as well. The attached three car garage offers plenty of parking and storage space. Welcome home!"},
{"bathrooms_half": "", "date_listed": "2016-09-15 00:00:00", "mls_name": "CLAW", "price": "3248000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16162304", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "10501 EASTBORNE AVE", "description": "This impressive modern construction sets the standard in this highly desirable Westwood location. Ideally located in close proximity to the best of what the Westside has to offer. 5 bd 5.5 ba & an open floor plan w/high ceilings make this home a great space for gathering w/friends & family. Perfectly prepare your meals to enjoy al-fresco in your gourmet kitchen, outfitted w/top of the line Thermador appliances. The master retreat is a relaxing atmosphere, w/a private balcony overlooking the backyard. The rm is complimented by an ambient fireplace & spa-like bathroom which hosts a massive multi-head wet room w/blue tooth shower heads & free standing tub. The four secondary bedrooms offer large volume & en-suite bathrooms. The home is complete w/ Control4 smart home system, to remotely control security cameras, music, temperature & lighting. The outdoor space is outfitted w/a 400+ sq/ft covered terrace wired for outdoor entertaining, has a beautifully landscaped backyard w/a fire pit"},
{"bathrooms_half": "", "date_listed": "2016-09-14 00:00:00", "mls_name": "CLAW", "price": "5750.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16162424", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave", "RangeOven"], "street_address": "1253 GRANVILLE AVE", "description": "GORGEOUS 4 BED, 3.5 BATH TOWNHOME FOR LEASE! AVAILABLE NOVEMBER 1. THIS UNIT HAS ITS OWN 2-CAR GARAGE W/ DIRECT ACCESS. THE LUXURY MASTER BEDROOM HAS A LOFT, A DUAL WALK-IN CLOSET, FIRE PLACE & LARGE MASTER BATHROOM! THERE IS A LARGE ROOF TOP SUN-DECK WITH NICE VIEWS! THE GOURMET KITCHEN HAS GRANITE COUNTERS AND VIKING APPLIANCES. THERE ARE 3 FULL BATHS + 1 POWDER ROOM (1/2) BATH! THERE IS ALSO IN-UNIT LAUNDRY. THIS TOWNHOME HAS BEEN MAINTAINED VERY WELL AND IS IN GREAT CONDITION. IT IS MOVE-IN READY AND IS IN A GREAT LOCATION. THIS WILL NOT LAST!"},
{"bathrooms_half": "", "date_listed": "2016-09-14 00:00:00", "mls_name": "CLAW", "price": "3488000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16162540", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "1012 2ND ST", "description": "Unit #1 is \"Pending\". Just one ocean view townhouse remains available for sale! Coastal contemporary brand new construction- a true labor of love! Direct ocean views from this sleek architectural 3 bedroom, 3.5 bath townhouse! Unmatched craftsmanship and attention to detail. Cutting edge design of steel, wood & glass- catwalks, floating walls, cloud drop ceilings, balconies, walls of fluted glass and an open floorplan. A real life Slim Aarons- palm tree and white water views from Miele adorned open kitchen and great room. Gorgeous master suite with open balconies and stunning bath. 2-car side-by-side parking in garage. New landscaping & buried powerlines. North of Wilshire and one block from Ocean Ave- live just moments from both third street promenade & renowned Montana Avenue!"},
{"bathrooms_half": "", "date_listed": "2016-09-14 00:00:00", "mls_name": "CLAW", "price": "2895000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16162570", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "1012 2ND ST", "description": "Unit #1 is \"Pending\". Just one ocean view townhouse remains available for sale! Architecturally significant turn-of-the-century Victorian cottage meticulously restored and transformed into a modern masterpiece. 3 bedrooms, plus office & 2.75 baths, with a sleek contemporary interior. Painstakingly restored and perfectly finished using the highest quality materials. High vaulted ceilings, white matte porcelain tile and an open floor plan full of natural light with fluted glass walls. Miele adorned kitchen with custom white cabinetry. Master suite features a large patio and luxurious spa-like bath. Unmatched attention to detail and craftsmanship. 2-car sideXside parking in garage. New landscaping. North of Wilshire and one block from Ocean Ave- live just moments from both third street promenade & renowned Montana Avenue!"},
{"bathrooms_half": "", "date_listed": "2016-09-15 00:00:00", "mls_name": "CLAW", "price": "499000.00", "bedrooms": "1", "bathrooms_full": "", "mls_id": "16162696", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "RangeOven"], "street_address": "1203 N SWEETZER AVE", "description": "Remodeled, spacious and light 1 bedroom and 1 bathroom condo in the coveted West Hollywood complex. Villa Las Brisas. Large open living room and dining area with private balcony. Remodeled eat-in-kitchen with stainless appliances, granite counter tops, and ample custom cabinets. Master bedroom with walk in closet and remodeled bathroom with double sinks and custom wood cabinets. This fantastic courtyard building offers a sunny pool & patio area, with separate BBQ, lounging space and work-out room. This excellent walk score location is perfect to enjoy all the fun that Santa Monica Blvd and West Hollywood have to offer."},
{"bathrooms_half": "", "date_listed": "2016-09-15 00:00:00", "mls_name": "CLAW", "price": "2300.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16162826", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "810 N TOWNE AVE", "description": "Impeccable home situated in one of the nicest neighborhood of Claremont. This lovely home has 4 bedrooms, 2 FULL bathrooms. Nice hardwood floors. Kitchen has granite counter tops. Open floor plan. Huge backyard for children to play. 4 spacious bedrooms. 2-car attached garage. Good school district. Very convenient location."},
{"bathrooms_half": "", "date_listed": "2016-09-15 00:00:00", "mls_name": "CLAW", "price": "4695000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16163034", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Microwave", "RangeOven"], "street_address": "215 21ST PL", "description": "Classic Mediterranean Spanish home designed by J. Charles. Built in 1998 on a 50x152 lot with a guest room above garage. Perfect floor plan- appx 4600sqft with step down living rm, high beamed ceilings, custom wallpaper, stone & hardwd floors thru-out. Large dining rm with built-ins & climate controlled wine cellar. Sweeping staircase with skylight leading upstairs to 4 graceful bdrms. Large kitchen with center island, pantry, professional Wolf range, Sub-Zero fridge, stainless steel appliances & fireplace in breakfast rm. Family rm w/French drs leading to large patio- perfect for entertaining w/fire pit, water feature & built-in BBQ. Beautiful master suite with custom built walk-in closet & office/sitting area. Luxurious white marble bath with steam shower, heated flrs, dbl sinks & soaking tub. Guest rm with bath over the 2-car garage. Private grassy yard with mature landscaping. Moments to the Brentwood Country Mart. Franklin school district."},
{"bathrooms_half": "", "date_listed": "2016-09-16 00:00:00", "mls_name": "CLAW", "price": "849900.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16163198", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "3714 FLORESTA WAY", "description": "Large 2b/2ba with a 3rd Bedroom option. Situated in the highly sought after Historic neighborhood of View Park is this beautiful Cape Cod residence. As you open the Black Onyx front door you are welcomed w/ a sun-filled living room warmed by beautiful peg & groove hardwood floors & a custom brick fireplace. Adjacent the living room is the step down dining room, flooded w/ an abundance of natural light & tree top views. The galley style kitchen w/ its crisp white countertops offers ample cabinetry & picturesque bay window seating w/ storage. Completing the downstairs is a ~ bathroom & an amply sized family room w/ a fireplace & custom built-ins. This room is large enough to accommodate a 3rd bedroom. Adjacent the den is a well-sized storage/bonus room w/ unlimited potential for an office, playroom, man cave or arts & crafts room. Upstairs, you are greeted by a guest bedroom & the master suite w/ 2 closets & a vanity area. Relax, entertain & enjoy beautiful sunsets in the tranquil backya"},
{"bathrooms_half": "", "date_listed": "2016-09-16 00:00:00", "mls_name": "CLAW", "price": "1449000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16163248", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "702 MARINE ST", "description": "An incredible opportunity to buy an over-sized corner lot just seven blocks from the Ocean. It could be a major fixer or a tear down, you decide. One thing is for sure, this is a prime Santa Monica Ocean Park location. The house is a classic 1912 Santa Monica bungalow. Bring your builder or designer."},
{"bathrooms_half": "", "date_listed": "2016-09-16 00:00:00", "mls_name": "CLAW", "price": "10950000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16163266", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "21844 PACIFIC COAST HWY", "description": "Meticulously remodeled Carbon Beach jewel. This 3 bedroom, 2 bath home with gated entry and beautiful courtyard leads you to the best location on the beach! Relax and unwind in your private hot tub on the large ocean front deck. Wood flooring throughout, air conditioned, and just steps to the sand. Just listed and easy to show!"},
{"bathrooms_half": "", "date_listed": "2016-09-22 00:00:00", "mls_name": "CLAW", "price": "3500.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16163826", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven", "Microwave", "Oven"], "street_address": "1301 SEWARD ST", "description": "Welcome to WEHO! West Hollywood HARD TO FIND pet friendly 2bd/1bath + bungalow. This very bright and charming bungalow is the main house of a detached duplex. Enjoy the serine front yard with privacy gate. Remodeled home features open floor-plan living room with fireplace, hardwood floors, formal dining area, upgraded kitchen with granite counter tops, washer/dryer in unit, Central AC, security alarm system, pet friendly with additional deposit (with restrictions). 2 blocks away from a park that's dog friendly. Close to the heart of WEHO and everything that it offers."},
{"bathrooms_half": "", "date_listed": "2016-09-20 00:00:00", "mls_name": "CLAW", "price": "2599000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16163996", "rooms": [], "appliances": [], "street_address": "1363 COLTON ST", "description": "Located in the S Echo Park / Westlake neighborhood, this double lot offers the opportunity to raise 40 residential units over 2 levels of daylight subterranean, with access off both Colton and Douglas Street. The Project just received Specific Plan Approval and calls for 37 market-rate and 3 low-income units. The site is situated on a corner that offers fantastic views of downtown and surrounding areas. Located next to the Echo Park Deep Pool and just north of Vista Hermosa Natural Park.Local to public transit and major freeways, with the 101 fwy just to the north and the 110 fwy just to the east."},
{"bathrooms_half": "", "date_listed": "2016-09-21 00:00:00", "mls_name": "CLAW", "price": "16550000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16164100", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Microwave", "RangeOven"], "street_address": "11768 ELLICE ST", "description": "Oceanfront vistas await at The Spanish Estate, an incomparable residential retreat perched on a private bluff top in Malibu's exclusive Marisol community. Masterfully designed by award-winning architect Barry Berkus A.I.A, this earthly paradise offers clear views of the Pacific the moment you pass through the great room's soaring 16' foot ceilings. Nighttime reflections of a star-filled sky can be seen in the 50-foot infinity edge pool, which seamlessly blends into the horizon stretching as far as Catalina Island. Dual master suites take advantage of the sun's arc across the sky and feature gallery-style walk-in closets. A sheltered courtyard spanning 3,200 sq ft. entertains with a wood-burning fireplace, BBQ, and lounge areas. An acre of immaculately restored coastal land lends a pristine, natural playground all to yourself, while world-class surfing and parasailing awaits by the water's edge. 20 minutes from your private plane at Camarillo airport to the door of this Malibu Estate."},
{"bathrooms_half": "", "date_listed": "2016-09-21 00:00:00", "mls_name": "CLAW", "price": "6495000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16164412", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "1310 NAPOLI DR", "description": "A harmonious union between architecture and nature, this Spanish Villa is set on a half-acre of beautiful land in the desirable Palisades. Originally built in 1923, the home remains true to its Spanish-style charm yet has since been exquisitely-restored to offer modern luxuries like new kitchen appliances and a sophisticated security and sound system. A balcony overlooking the gardens romanticizes the master suite while a hand-painted ceiling by the notable Jeff Turner turns one's attention to the home's incredible array of craftsmanship. Within the property's luscious backyard is a freestanding stucco fireplace, spacious bar area and BBQ grill, pool, and plenty of lounge areas that extend the entertaining possibilities well into dusk. This property has been featured on both the Brentwood and Palisades Garden Tours."},
{"bathrooms_half": "", "date_listed": "2016-09-22 00:00:00", "mls_name": "CLAW", "price": "3075.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16164760", "rooms": ["bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "1616 N LA BREA AVE", "description": "NOW OFFERING MOVE IN SPECIALS! This is the last TOP FLOOR CORNER unit! Welcome to The Lofts On La Brea. The newest luxury community. This large studio is perfect for the entertainer that wants the high-end lifestyle. Large enough to have a living area and a bedroom, this unit features high end finishes of Italian Porcelain, Stainless Steel appliances, Dishwasher, Washer/Dryer, private wrap around balcony balcony and expansive floor to ceiling windows. The Lofts on La Brea features a fitness center, lounge, business center and an entertainers rooftop deck with BBQ. The Lofts are walking distance to restaurants, nightlife, hiking and shopping...these remaining units will not last. Actual unit in photos."},
{"bathrooms_half": "", "date_listed": "2016-09-22 00:00:00", "mls_name": "CLAW", "price": "6475.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16164788", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "928 19TH ST", "description": "Fantastic location! Flexible lease terms- Landlord will consider short, or long term. Just 2 blocks to Montana Avenue shops, cafes and restaurants! Franklin School District! Updated townhouse with 2bd+2.5ba plus loft & tons of outdoor space including a huge, private rooftop deck with ocean and mountain views. Hardwood floors, plantation shutters, recessed lighting, cherry stained cabinets. Full of natural light with an open and versatile floor plan. Living room features soaring ceilings & fireplace. Chef's kitchen with granite counters and stainless steel appliances opens to dining room with 2 large tiled patios perfect for BBQ & dining al fresco. Large loft/family room. Both bedrooms feature walk-in closets and private baths. Master bathroom boasts amazing double shower with jets, double sinks. Jaw-dropping private rooftop deck with panoramic mountain, ocean & city views. Direct access, private 2-car garage. Available and move-in ready!"},
{"bathrooms_half": "", "date_listed": "2016-10-03 00:00:00", "mls_name": "CLAW", "price": "888000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16164958", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ"], "street_address": "1425 SYCAMORE AVE", "description": "Located in Northwest Glendale, above Bel Aire Drive, this stylishly remodeled home is sure to delight the most discerning buyer! The gorgeous chef's kitchen is straight out of Restoration Hardware and leads to a large formal dining room complete with a beautiful, decorative brick fireplace. The home also features a comfortable living room with gleaming wood floors, beautiful windows and wide crown moldings, 3 large bedrooms, 1.5 remodeled baths and an additional den/office/library/princess room. Moving outside you'll find an extra cool built-in BBQ complete with refrigerator, herb garden and dining area. This homes also comes with a huge 2 car garage and, unusual for California, a large walk in basement...or is it your gym? Your media room? Studio? You decide. Close to parks, shops, Burbank and Studios. Welcome Home!"},
{"bathrooms_half": "", "date_listed": "2016-09-22 00:00:00", "mls_name": "CLAW", "price": "1235000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16165062", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "2445 WALGROVE AVE", "description": "Charming 1920s farmhouse on the border of Mar Vista and Venice. This home was originally built in 1925 in La Canada and was moved to the current address in the 1960s. It exudes a vintage ranch-style charm that fits in perfectly with the vibe of Venice. The 3 bedroom, 2 bath home is highlighted by a Great Room that blends the kitchen, dining, and living rooms into one sumptuous space with exposed beam ceilings and a wood-burning fireplace. The master bedroom includes an en suite bathroom, sizable closet, Spanish tiles, and French doors that lead out to the expansive backyard. The backyard is spacious, quiet, and includes a pergola-covered entertaining area that is surrounded by lush landscaping. The bedrooms and yard are set at the back of the lot, which makes for a serene and peaceful setting. Located just a stone's throw from all the restaurants and shops on Washington Blvd., and just minutes from Abbot Kinney, this home is an outstanding value!"},
{"bathrooms_half": "", "date_listed": "2016-10-04 00:00:00", "mls_name": "CLAW", "price": "865000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16165260", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "18913 ADOLFO AVE", "description": "Welcome to this wonderful small gated community in the heart of Tarzana. Drive up and you are greeted with a stamped driveway and rose bush lined path leading to a beautiful newer 4 bedroom property. As you enter you are welcomed with rich hardwood floors, spacious living room w/stone mantle fireplace, crown moldings and recessed lighting. Gracious formal dining room opens to gourmet kitchen with granite counters, stone backlash w/designer tiles, s/s appliances and custom cabinetry. Grand staircase leads from family room to upstairs landing with skylight. Upstairs features 3 good sized bright bedrooms + Wonderful master suite with fireplace, huge walk in closet + Sumptuous bath with double vanities, custom built-ins, Oversized shower and spa like tub. Nice sized yard is perfect for entertaining and family living. Centrally located to Metro Line, shopping, freeways & bike path makes this a great place to call home!"},
{"bathrooms_half": "", "date_listed": "2016-09-26 00:00:00", "mls_name": "CLAW", "price": "3250000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16165528", "rooms": [], "appliances": [], "street_address": "0 Ramera Mountainway", "description": "Smashing ocean views from 91 acres in the beautiful Santa Monica Mountains overlooking Malibu and Point Dume. This offering consists of seven contiguous ocean view lots only 2 1/2 miles from Pacific Coast Highway. One of the last large land offerings in Malibu! The views don't get better - perfect for the buyer looking to get away from it all but still be only 10 minutes from shopping, the beach and schools. There is paved access to the lots and underground LVMWD water. Peace and quiet surround you. Each lot has a Certificate of Compliance and an ocean view as well as views of Catalina and city lights. Assessor's Parcel Numbers are 4465-006-060, 061, 062, & 051 and 4465-005-040, 042, & 043."},
{"bathrooms_half": "", "date_listed": "2016-09-26 00:00:00", "mls_name": "CLAW", "price": "2500000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16165532", "rooms": [], "appliances": [], "street_address": "6041 KANAN DUME RD", "description": "Amazing land offering of almost six acres within 1/2 mile of Pacific Coast Highway. Surrounded by multi-million dollar homes, the property is one of the few left that are able to accommodate multiple homes - four to be exact - or build one large family compound. All four lots were created legally. Close to shopping, schools and Zuma Beach - some ocean views. Driveway graded in along with fire department turn around, retaining walls and drainage - all permitted. Agent has old reports and a topographical survey. So much work done! Addresses included in this offering are 6011 Kanan Dume, 6021 Kanan Dume, 6031 Kanan Dume & 6041 Kanan Dume"},
{"bathrooms_half": "", "date_listed": "2016-09-26 00:00:00", "mls_name": "CLAW", "price": "2550.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16165994", "rooms": ["bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "1616 N LA BREA AVE", "description": "NOW OFFERING MOVE IN SPECIALS! THE BUILDING IS ALMOST SOLD OUT! Welcome to The Lofts On La Brea. The newest luxury community. This large top-floor studio is perfect for the entertainer that wants the high-end lifestyle. Large enough to have a living area and a bedroom, this unit features high end finishes of Italian Porcelain, Stainless Steel appliances, Washer/Dryer, private balcony and floor to ceiling windows. The Lofts on La Brea features a fitness center, lounge, business center and an entertainers rooftop deck with BBQ. The Lofts are walking distance to restaurants, nightlife, hiking and shopping...these remaining units will not last. Actual unit in photos."},
{"bathrooms_half": "", "date_listed": "2016-09-27 00:00:00", "mls_name": "CLAW", "price": "4350.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16166222", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "1522 AMHERST AVE", "description": "Beautifully appointed single level condo in a newer Mediterranean courtyard building. A great open floor plan with 3 bedrooms/2.5 bathrooms and filled with natural sunlight. The chef's kitchen has cherry cabinets, gas stove, stainless steel appliances and a large breakfast bar area that opens to the living and dining areas. Travertine tiling is in the kitchen and baths, carpeting in the bedrooms and beautiful wood floors are throughout. Balcony faces South and accommodates enough room for a bbq and a green thumb. The Master bedroom has a large walk-in closet and an in suite bathroom with a sunken tub and a separate spacious shower. Gated/controlled access building with common roof top deck. Located in West L.A. in close proximity to coffee shops, restaurants and retail as well as being adjacent to Brentwood and Santa Monica."},
{"bathrooms_half": "", "date_listed": "2016-10-07 00:00:00", "mls_name": "CLAW", "price": "599000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16167196", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "483 CRANE", "description": "Enchanting 1928 Spanish Bungalow high atop Mt. Washington. Perched above street level on a street-to-street lot, this graceful home has been lovingly preserved and is filled with original detail. Features include; wood floors, barrel ceilings, Batchelder & Sautillo tile, wood windows, large pedestal sink and built ins. The fenced in yard is a blank canvas for the creative gardener and is also ideal for entertaining. Located near the Gold Line and central to Downtown L.A, Silver Lake, Pasadena and the studios. A true gem for someone seeking an urban sanctuary!"},
{"bathrooms_half": "", "date_listed": "2016-10-03 00:00:00", "mls_name": "CLAW", "price": "1998000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16167440", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave", "RangeOven"], "street_address": "901 TEAKWOOD RD", "description": "Mid-Century modern with gorgeous canyon views. This 2,835 sqft home has 4 bed, 3 baths and is bright and spacious throughout with plenty of room for entertaining. The living room with fireplace has large sliding doors that lead to the oversized covered deck. The master suite with balcony has walk in closets and beautiful views. Welcome Home."},
{"bathrooms_half": "", "date_listed": "2016-10-03 00:00:00", "mls_name": "CLAW", "price": "1498000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16167460", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "429 MONTANA AVE", "description": "Rare opportunity to purchase this wonderful 3 bed, 2 bath penthouse in a high demand Santa Monica area. Near shops, restaurants, Santa Monica Pier, Promenade, Santa Monica stairs and the beach; this home allows you to be near the best that West Side has to offer. The spacious rooms are equipped with large windows allowing for natural, radiant light. The living room with fireplace has high ceiling with a circular staircase leading to the loft. Master suite has a fireplace, walk in closet and private patio with views. Welcome Home."},
{"bathrooms_half": "", "date_listed": "2016-10-29 00:00:00", "mls_name": "CLAW", "price": "7750.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16167486", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "3292 INGLEWOOD", "description": "If you love the magnificence of a great view, this is one of best. King of the Hill panoramic views of Los Angeles and the the mountains beyond. Dramatic architectural home by Escher Gunewardena, located at the top crest of Mar Vista Hill. Open floor plan features an 11' x 27' Fleetwood glass unit to create a true indoor/outdoor space. Ceramic tile, venetian plaster and a wood burning fireplace provide this modern architectural home a warm feeling. This 3 bedroom, 2.5 bath home has a separate office and \"bonus room\". It features built-in walnut bookshelves, Sub Zero and Miele appliances, a cedar hot tub, a small hillside deck and other amenities. Mature landscaping and an enclosed front yard give privacy and serenity. A peaceful and unique home that is fabulous for entertaining. Bike to Venice Beach or walk to the local shops and Whole Foods. In the coveted Mar Vista School district."},
{"bathrooms_half": "", "date_listed": "2016-10-04 00:00:00", "mls_name": "CLAW", "price": "3849000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16168294", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "1 W CENTURY DR", "description": "Live at \"The Century\" and experience the finest in estate-style living with five-star amenities. The prestigious full-service 42-story high rise was designed by Robert A.M. Stern and features all the luxuries - concierge & valet parking, full kitchen outdoor dining with fireplace, fountains, fully equipped fitness center, spa, 75' pool and cabanas, children's playroom, wine cellar, screening room with surround system, landscaped estate gardens, and more. This residence is the largest \"D\" floor plan with numerous luxurious upgrades, hardwood floors. and floor-to-ceiling glass windows in each room offering panoramic north facing city lights views. Indulge your inner gourmet in an open kitchen, with top-of-the-line appliances. Your urban oasis awaits. Offered for lease at $18,500 per month"},
{"bathrooms_half": "", "date_listed": "2016-10-04 00:00:00", "mls_name": "CLAW", "price": "18500.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16168406", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "1 W CENTURY DR", "description": "Live at \"The Century\" and experience the finest in estate-style living with five-star amenities. The prestigious full-service 42-story high rise was designed by Robert A.M. Stern and features all the luxuries - concierge & valet parking, full kitchen outdoor dining w/fireplace, fountains, fully equipped fitness center, spa, 75' pool and cabanas, children's playroom, wine cellar, screening room w/surround system, landscaped estate gardens, and more. This residence is the largest \"D\" floor plan with numerous luxurious upgrades, hardwood floors. and floor-to-ceiling glass windows in each room offering panoramic north facing city lights views. Indulge your inner gourmet in an open kitchen, with top-of-the-line appliances. Your urban oasis awaits. Offered for sale at $3,849,000."},
{"bathrooms_half": "", "date_listed": "2016-10-06 00:00:00", "mls_name": "CLAW", "price": "6895000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16168744", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "323 ADELAIDE DR", "description": "Perfectly situated on the most sought-after block of Adelaide Drive, this luxury four-level Santa Monica canyon home offers an idyllic lifestyle inclusive of breathtaking ocean & canyon views. Nestled into the canyon, its secluded grandeur greets you at the entrance where size is concealed but character abounds. The experience unfolds instantly as one steps into the elevated entry situated above a grand 2 story living room where soaring ceilings, Venetian plastered walls & glass window lined views are juxtaposed within the warmth of the home's luxurious Tuscan-inspired detailing. Floor to ceiling French doors drench the living room, formal dining room & lux master suite, with natural light, opening onto generous balconies that are focal points of the residence, used for dining al fresco & private meditation. The experience continues throughout each room of the incredibly designed floor plan, where each room is appointed with the best of modern living."},
{"bathrooms_half": "", "date_listed": "2016-10-05 00:00:00", "mls_name": "CLAW", "price": "3095.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16168832", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "2041 N COMMONWEALTH AVE", "description": "Welcome to 2041 N Commonwealth. Be the the first to live in this Top-floor Corner unit since the full remodel including new floors, fresh paint, new counter tops and new appliances. A large master with a large walk in closet complements the perfect second bedroom or office. Relax on your private balcony(With views of Griffith) or stay inside with the cool central AC. This unit is situated with only one shared wall and vast views of the hills. The building is pet friendly, features a crystal clear community pool, on-site laundry and has a secure gated garage with parking included. Experience everything Los Feliz has to offer by being centrally located to all your needs and indulgences. You can walk to Hillhurst or Vermont for local shopping, dining and entertainment or enjoy a hike with Griffith park just moments away. Other units available at similar prices. Actual unit in photos."},
{"bathrooms_half": "", "date_listed": "2016-10-10 00:00:00", "mls_name": "CLAW", "price": "799000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16168984", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "2601 PURDUE AVE", "description": "Westside charmer. Coved ceilings, archways, wood floors, fireplace in a step-down living room. This home has been well maintained and upgraded with central heat and A/C, copper plumbing, CA cellar with laundry. 2 bedrooms and 1 bath-original tile work in excellent condition. Charm, and function. Move-in ready or use as an investment property. Excellent outdoor space and mature landscaping."},
{"bathrooms_half": "", "date_listed": "2016-10-06 00:00:00", "mls_name": "CLAW", "price": "1799000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16169036", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave", "RangeOven"], "street_address": "1101 N KENTER AVE", "description": "Live above the city of lights in the peaceful and desirable Crestwood Hills area of Brentwood. This 3 bed/4 bath architectural home with wonderful canyon and ocean views boasts an open floor plan and large windows allowing for tons of natural light creating a secluded oasis feel with all the comforts of fine living. Wake up to nature in the master suite with a peaceful canyon view. Freely enjoy the outdoors and entertain with 700 sq. ft. of deck space. The downstairs area is a perfect place for guests to enjoy or it can be an ideal home office that is equipped with a bathroom, small kitchen area, fireplace and deck. Short distance to Crestwood Hills Park, Santa Monica trails and the sought after Kenter Canyon Elementary School."},
{"bathrooms_half": "", "date_listed": "2016-10-06 00:00:00", "mls_name": "CLAW", "price": "2249000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16169094", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "2765 CASIANO RD", "description": "Come embrace a skillful blend of elements that gives this romantic Mediterranean energy and joy. Tour the thoughtful floorpan that will impress. Many incredible features & fine details make it unique. Features include tranquil views, open kitchen and family room with a unique use of woods, granite, travertine & tile throughout. Over 3,970 SF w/ a master suite + 4 bedrooms & 4.5 baths. Four bedrooms situated upstairs. Inviting kitchen with views of the pool and grounds. Well positioned appliances and cabinetry create a canvass for cooking greatness. Approximately 9,200 sq ft lot. Private backyard w/ lush landscaping and pool. Welcome home."},
{"bathrooms_half": "", "date_listed": "2016-10-06 00:00:00", "mls_name": "CLAW", "price": "6595000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16169172", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "920 Alta AVE", "description": "Architectural oasis located on a quiet corner lot North of Montana- just moments from restaurants & the beach. Steel, wood & glass set the stage for serene living tucked behind privacy walls & hedges. Clean lines & crisp details; built & designed by Mario Romano. 3 levels enhance this home's versatility allowing for private spaces, formal gatherings & countless casual entertaining options! Bleached oak hardwood, skylights, Fleetwood pocket-doors, great art walls & hand-selected designer finishes perfect over 6,200sqft. Built energy conscious with solar panels (SunPower) for electricity & solar thermal for water heating. 4 bdrms upstairs enjoying treetop views, plus 2 bdrms on the lower levels create an ideal floorplan. \"Front\" & \"back\" yards, hidden from the street behind walls & landscaping. An elevator services all floors topped at the roof deck surrounded by mountain, sunset & palm tree views. Reflecting the idealized Santa Monica lifestyle this home truly allows for life in art."},
{"bathrooms_half": "", "date_listed": "2016-10-07 00:00:00", "mls_name": "CLAW", "price": "8499000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16169260", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Microwave", "RangeOven", "Gas", "Oven"], "street_address": "1116 LINDA FLORA DR", "description": "Designed by renowned architect Walter Scott Perry in the classic modern Bauhaus tradition, this newly remodeled, 5 bedroom & 6 bathroom contemporary home is sited on a serene, half-acre knoll in Bel Air with sweeping unobstructed views of The Getty, Santa Monica, Catalina and Bel Air canyons.All interior and exterior spaces throughout the home have been thoughtfully transformed, incorporating the finest of timeless materials and finishes, while colors are used to great visual effect, beautifully enhancing the contemporary ambiance and impressive scale of the home by extending the interior outward and the exteriors inward.Rich in exquisite architectural detailing, the home overlooks resort-like grounds to present a secluded, tranquil environment perfect for entertaining and enjoying the outdoor amenities. All the while,resting in comfort and ease as this California Beauty sits atop 23 caissons!"},
{"bathrooms_half": "", "date_listed": "2016-10-08 00:00:00", "mls_name": "CLAW", "price": "875000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16169676", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins"], "street_address": "750 S BUNDY DR", "description": "Located in the heart of Brentwood, minutes from some of the best restaurants, boutiques and farmers markets in Los Angeles, this stylish condo beckons you home. Enjoy a thoughtfully-designed open floor plan and prime amenities like the sprawling hardwood floors leading you to a generous open air balcony. An elegant well-appointed kitchen includes granite countertops, a wine fridge and a breakfast nook, setting an idyllic scene in which to start each day. A bountiful master bedroom suite includes a fireplace, custom curtains and a fully-outfitted marble bath with a large soaking tub. Other luxury amenities include Hunter Douglas custom shades, double-pane windows, reverse osmosis water filtration system, HEPA (High Efficiency Particulate Air) filter. Revel in all the conveniences you need and more with controlled access, a swimming pool and spa, and ample parking for company. Sophistication and style at your fingertips. An extraordinary place to call home."},
{"bathrooms_half": "", "date_listed": "2016-10-13 00:00:00", "mls_name": "CLAW", "price": "779000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16170084", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "1508 12TH ST", "description": "ATTENTION INVESTORS looking for an updated easy to manage condo with low dues! Tenant in place until NOV 1st 2017 at $3,300 per month. Can be shown with 48hrs notice. Just 12 blocks from the sand? At this price? Yes, its true! Don't miss this completely remodeled condo featuring new flooring throughout, custom travertine bathrooms and large bedrooms w/built-in closets. Additional upgrades include in-unit washer/dryer, new window treatments, and 1 car gated covered parking with storage. Take advantage of this convenient location near highly desirable schools, fantastic restaurants and Santa Monica's charming 3rd Street Promenade. Small building with only 11 units and low HOA dues. Perfect for any first time buyer or investor."},
{"bathrooms_half": "", "date_listed": "2016-10-13 00:00:00", "mls_name": "CLAW", "price": "20000000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16170236", "rooms": [], "appliances": [], "street_address": "2317 Dickenson Road", "description": "An hour outside of Los Angles with country and ocean views of Ojai sits Flying D Ranch. The ultimate ranch - surrounded by a seasonal creek and expansive terrain. Consisting of 1,281 acres and 7 parcels (7 parcels included sale (APN: 038-0-050-01; 038-0-050-02; 038-0-050-03; 038 0-050-14; 038-0-050- 15; 038-0-050-16; 102-0-140-35), the ranch has 145 profitable acres of avocado and lemon agriculture. The ranch's main residence, designed by famed architect Austen Pierpont, features beautiful views, and there is a barn & 3 other ranch-hand residences on property. The topography is diverse allowing for a multitude of uses - dude ranch, housing development, golf resort, luxury ranchettes, working ranch with vineyards or whatever you can imagine!"},
{"bathrooms_half": "", "date_listed": "2016-10-13 00:00:00", "mls_name": "CLAW", "price": "1589000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16170260", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "3181 FEDERAL AVE", "description": "Welcome to this Mar Vista/ Westdale Trousdale charmer on a wonderful tree lined street centrally located to everything the neighborhood has to offer.This pristine home offers 4 spacious Bedrooms (2 en-suite) wonderful opening living space with hardwood floors, skylights, recessed lighting, paned windows allowing tons of natural light. Great room concept with living room and dining room opening to Family room thru a wall of glass retractable windows opening to spacious kitchen with granite counter tops, tremendous storage, eating area and inside laundry. The secluded backyard offers great privacy w/ fruit trees, patio and grass areas great for entertaining, bonus room off the garage. Located in the Coveted Mar Vista Elementary School area."},
{"bathrooms_half": "", "date_listed": "2016-10-12 00:00:00", "mls_name": "CLAW", "price": "5995000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16170438", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Range Hood", "Microwave", "RangeOven"], "street_address": "1125 NAPOLI DR", "description": "This rare single story contemporary is a WOW! In the \"Coastal Modern\" style of its celebrity designer Tim Clarke, interiors include Balinese ceilings, floor to ceiling windows/doors, and a seamless indoor-outdoor flow. High ceilings throughout are ideal for art lovers and the backyard oasis is an entertainer's dream. Enjoy the oversized master bedroom suite with sitting area, dual spacious closets, master bath with steam shower, oversized tub and outdoor shower, all overlooking a bamboo garden. Gourmet Kitchen with adjacent Family Room, 5 bedrooms, den & gym complete the home and its easy-living lifestyle. Lush landscaping envelopes the property, a fitting backdrop to the resort-like outdoor spaces. Functional & stylish outdoor living room rests beneath a heated pergola with 55-inch TV. Pool, spa and play area all accessible from the French doors that open to the backyard from every room. Treat yourself to this one-of-a-kind custom home with the welcoming feel of an intimate retreat."},
{"bathrooms_half": "", "date_listed": "2016-10-17 00:00:00", "mls_name": "CLAW", "price": "3895000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16170720", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "RangeOven"], "street_address": "17795 CALLE DE PALERMO", "description": "Welcome home to this beautiful Contemporary Traditional in the exclusive guard gated community of the Palisades Country Estates. This great family home, at the end of a cul-de-sac, offers 5 spacious en suite bedrooms, bright sophisticated cook's kitchen with large center island, breakfast area and walk-in pantry. The family room, living room and den/office provide direct access to the backyard where you'll find an entertainer's delight featuring an outdoor BBQ area, fireplace, covered patio and fantastic pool, replete with waterfall and integrated water slide."},
{"bathrooms_half": "", "date_listed": "2016-10-12 00:00:00", "mls_name": "CLAW", "price": "999000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16170802", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "235 MAIN ST", "description": "A spacious expertly designed condominium located on Main Street in Venice. Located in close proximity to Whole Foods, Rose Ave, and Venice Beach. This two bedroom two bath recently updated condo boasts an open floorplan and custom artistic finishes. Ideal for anyone who wants to live the beach lifestyle while having a secluded and tranquil home."},
{"bathrooms_half": "", "date_listed": "2016-10-17 00:00:00", "mls_name": "CLAW", "price": "3499000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16171376", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "Microwave", "RangeOven", "Built-In Gas", "Cooktop - Gas"], "street_address": "15630 WOODVALE RD", "description": "Located in the heart of Royal Oaks of Encino, sits a newly remodeled contemporary California craftsmanship 5BD/5.5 BA. This Cape Cod-inspired interior has rich French Oak floors throughout, generous living room with a fireplace, both formal dining and conversation rooms, a two-sided fireplace with an open kitchen, a cozy breakfast area, and all offer picturesque outdoor views. The kitchen itself is fit for a master chef equipped with a beautiful Calcutta marble center island with its own sink, six burner Wolfe oven stove, Sub Zero refrigerator, farmhouse sink and walk-in pantry. Upstairs, the four bedrooms come complete with a walk-in closet and marble bath, while the master suite offers dual walk-ins, double sinks, an oversized shower with a rain shower head and a free-standing tub overlooking the landscaping. The surrounding grounds with a lot size of 17,000 sq. ft. features a sparkling pool, spa, fire pit and large BBQ area, making it the perfect space to escape or to entertain."},
{"bathrooms_half": "", "date_listed": "2016-11-03 00:00:00", "mls_name": "CLAW", "price": "969000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16171784", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "1227 GRANVILLE AVE", "description": "Spacious two story, top floor condo with 3 bedrooms and 3 bathrooms. Close proximity to the area's best bars and restaurants. Condo has vaulted ceilings, hardwood floors in living room, loft ideal for home office, stainless steel appliances, fire place, rooftop patio perfect for entertaining, washer and dryer inside unit, side by side parking (2 cars)."},
{"bathrooms_half": "", "date_listed": "2016-10-17 00:00:00", "mls_name": "CLAW", "price": "825000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16171978", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "7462 CLINTON ST", "description": "Melrose Village Spanish Bungalow Heavy Fixer/Tear-down. Property to be sold in AS-IS condition with no repairs, credits, or warranties. Located in prime 90036 neighborhood moments from The Grove, Melrose Village, West Hollywood, Pan Pacific Park, and the very best of LA! Cash offers ONLY. Average sales price in neighborhood is $1,748,460 (in last 6 months) with new homes selling as high as $3,987,000. Location is phenomenal and highly coveted. See private remarks. Photos of exterior coming soon."},
{"bathrooms_half": "", "date_listed": "2016-10-19 00:00:00", "mls_name": "CLAW", "price": "3750.00", "bedrooms": "1", "bathrooms_full": "", "mls_id": "16172792", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "610 N Orlando AVE", "description": "Extensively Remodeled Units for Lease in prime and hip WEHO! Modern designer finishes include French Oak laminate flooring throughout, kitchen with stainless steel appliances, caesartone counters and backsplashes, and new cabinetry. The unit features a spacious a living and dining area with a large patio. A master bedroom, an enclosed bonus room/den, 2 baths appointed with oversized showers, in unit laundry, nest thermostat, great storage, and gated parking. Located a block from Melrose, which offers world class shopping, dining, and other facets of entertainment."},
{"bathrooms_half": "", "date_listed": "2016-10-24 00:00:00", "mls_name": "CLAW", "price": "4495000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16172810", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "RangeOven"], "street_address": "11166 W SUNSET", "description": "A magnificent new gated home beautifully situated on a large lot (over 13,000 feet) at the intersection of Bel-Air and Westwood. Convenient and easy access to Westwood Village, Beverly Hills, Brentwood, and the 10 and 405 freeways. Gorgeous traditional architecture with motor court and dual gates. Awash in natural light, this home boasts a great open floor plan, high beamed ceilings, crown moldings, beautiful white oak floors. There are five bedroom suites, including a sumptuous master with dual closets. The kitchen/great room is a dream with wonderful work and play areas, great subzero and Viking appliances and a great view of the back yard and pool. There is also an office, family room, temp controlled wine closet and upstairs family room. The grassy back yard is large with lovely landscaping and hedges and a great custom lounging and BBQ area. The pool features a spa, waterfall and built in cover. There is an amazing indoor/outdoor loggia with fireplace and TV area."},
{"bathrooms_half": "", "date_listed": "2016-11-03 00:00:00", "mls_name": "CLAW", "price": "5985000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16172836", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "1102 GALLOWAY ST", "description": "A grand union of modern craftsmanship and traditional architecture, this magnificent Cape Cod was conceived by EMMA, the developers responsible for the redesign of Santa Barbara Airport's historic terminal, as well as many of L.A.'s most esteemed structures. High-end finishes wrap every freshly-laid corner from the state-of-the-art kitchen, through all six bedrooms and down to the lavish basement theatre and wine cellar. Ascend via elevator all the way up to the rooftop deck and drink in 180-degree views-a glimmering swimming pool below and the surrounding tree-lined alphabet streets of the neighborhood. A short ride from Palisades Village, what will soon be the central community outpost for the coveted enclave of Pacific Palisades, this home is characterized by a location as prime as the structure itself."},
{"bathrooms_half": "", "date_listed": "2016-10-19 00:00:00", "mls_name": "CLAW", "price": "3750.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16172880", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "610 N Orlando AVE", "description": "Extensively Remodeled Units for Lease in prime and hip WEHO! Modern designer finishes include French Oak laminate flooring throughout, a kitchen with stainless steel appliances, caesartone counters and backsplashes, and new cabinetry. This spacious unit features spacious living, dining area with balcony, 2 bedrooms, 2 baths appointed with oversized showers, in unit laundry, nest thermostat, great storage, and gated parking. Located a block from Melrose, which offers world class shopping, dining, and other facets of entertainment."},
{"bathrooms_half": "", "date_listed": "2016-10-21 00:00:00", "mls_name": "CLAW", "price": "2595000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16172958", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "11158 OPHIR DR", "description": "Gorgeous 3 Bedroom, 3 Bathroom Traditional home exquisitely remodeled! Great flow for entertaining with formal dining & living area, hardwood floors, beautiful moldings, two fireplaces, top of the line appliances, security & stereo system throughout. Large gourmet kitchen with breakfast area that leads to the family room with french doors to a cozy backyard with built-in-barbeque, fireplace, and views of the City and Canyon."},
{"bathrooms_half": "", "date_listed": "2016-10-19 00:00:00", "mls_name": "CLAW", "price": "9250.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16173026", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins"], "street_address": "2307 OAKWOOD AVE", "description": "Eco Chic Living in the heart of Venice! 2,400sq feet single family house on three levels built in 2008. 3 bedrooms, 3.5 baths.Lofty architectural living w volume, light & space. High ceilings, multiple skylights & radiantly heated hickory wood floors throughout. Open entertainment level includes an open cook's kitchen w Caesarstone counters, seated island, custom cabinetry and designer appliances. Floating staircases to the second floor bedrooms & rooftop terrace w 360 degree view. 700sq feet lower level with bathroom & patio.Coeur d'Alene Elementary district. Close to the beach and Abbot Kinney"},
{"bathrooms_half": "", "date_listed": "2016-10-20 00:00:00", "mls_name": "CLAW", "price": "1495000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16173052", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "10267 LELIA LN", "description": "Situated at the end of a quiet canyon lane, this stunning contemporary home offers a tranquil, serene setting. Soaring ceilings, expansive windows, and skylights create tremendous natural light throughout. The three-story home is set amongst magnificent magnolia, pine, and eucalyptus trees. Custom cabinetry, stainless-steel appliances, and granite outfit the warm, entertainer's kitchen. Second floor loft space with built-in desk and bookcases overlook the family room's dramatic two-story ceiling. Spectacular master suite features a capacious dressing room and generous bathroom with jetted spa tub and dual pedestal sinks. Two sizable bedrooms and full bathroom occupy the third level. Enjoy picturesque tree top views from the expansive rooftop patio. Lelia Lane is just off of Crater Lane, with a streetlight onto Beverly Glen and across from the local favorite, Glen Market. Welcome Home."},
{"bathrooms_half": "", "date_listed": "2016-10-20 00:00:00", "mls_name": "CLAW", "price": "1295000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16173190", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "3632 VALLEY MEADOW RD", "description": "This picturesque mid-century ranch style home on a large quiet lot in coveted Royal Woods is the home you have been waiting for! Open and flowing public areas separated from the private bedroom wing make this floorplan ideal for family living. Featuring high-end appliances this kitchen has endless counter space and a cozy breakfast nook. The living and dining areas are framed with beamed ceilings and are flooded with light from a wall of windows, while the family room opens to the backyard through sliding glass doors. The master suite, complimented by a stunning master bath, which boasts a double vanity, a glass enclosed rain shower, and a separate soaking tub, opens to the generous enclosed patio. Surrounded by lush foliage and old growth trees, the grounds offer a private sanctuary seemingly a world apart from the nearby city life. With it's excellent location and broad appeal, this is a home that should not be missed."},
{"bathrooms_half": "", "date_listed": "2016-10-20 00:00:00", "mls_name": "CLAW", "price": "9250000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16173212", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "1024 PALISADES BEACH RD", "description": "As part of Santa Monica's historically exclusive Gold Coast, where Hollywood's elite first converged to claim a beachfront oasis to call their own, this John Byers-designed Spanish Colonial Revival elevates California living with sweeping, panoramic views spanning from Palos Verdes to Malibu. Original charm from 1929 blends with modern renovations that include a multi-purpose entertaining level with bar, movie screen, fireplace & wine cellar. French doors in the kitchen & dining area open outwards to embrace a sunlit courtyard, while beautiful terracotta tiles indoors & out help to distinguish the home's architectural style. An elevated breezeway leads from the upper-level bedrooms to the master suite wherein lies a Juliet balcony overlooking the landscaped backyard & coast. A rarity so close to the sand, this generous parcel of land has played host to both quiet mornings with the paper & large, celebratory events throughout the years, a testament to the home's indescribable allure."},
{"bathrooms_half": "", "date_listed": "2016-10-20 00:00:00", "mls_name": "CLAW", "price": "35000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16173320", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "Microwave", "RangeOven"], "street_address": "32506 PACIFIC COAST HWY", "description": "Stunning beach front property! This remodeled home nestled in the Encinal Bluffs, sits right above the sand on a quiet beach cove. This quintessential Tuscan home features authentic finishes of reclaimed hardwood floors, custom stonework, 3 handmade fireplaces & walls of glass doors that open to a spectacular wrap around deck. Just steps to the water on Malibu's premier beach. Come escape to this private magical beach home. Off season rate is 35k. Summer season is 60K."},
{"bathrooms_half": "", "date_listed": "2016-10-20 00:00:00", "mls_name": "CLAW", "price": "35000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "16173342", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins"], "street_address": "6766 PORTSHEAD RD", "description": "This magnificent Tuscan home with stunning ocean views sits on over an acre of beautiful landscaped grounds. The property is located in the highly desirable neighborhood of Point Dume with beach keys to Little Dume Beach. This private, tranquil property features a new pool, several seating areas, a fireplace, 2 ponds & 3 additional water features. The home has large sliding doors that open to gardens and a lovely outdoor dining area that looks out over the Santa Monica Bay. No expense spared in the making of this 6 bed, 5.5 bath home that truly offers a magical setting in a prime location. Authentic finishes include reclaimed hardwood floors throughout, state of the art kitchen w/reclaimed wood cabinets with granite counter top, antique lighting & custom designed furnishings. A great family home with all the amenities one could desire, come enjoy the Malibu life. High Season $60K"},
{"bathrooms_half": "", "date_listed": "2016-10-21 00:00:00", "mls_name": "CLAW", "price": "3995.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16173736", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "525 N N. CRESCENT HEIGHTS", "description": "Adorable renovated Country English cottage with hardwood floors, two bedrooms, two renovated baths and tons of natural light. Master suite with renovated spa bath with vaulted ceilings and skylight. Updated kitchen with newer appliances including refrigerator, washer, and dryer. High ceilings in living room, updated plumbing and electrical. Off street parking and spacious, gated rear yard."},
{"bathrooms_half": "", "date_listed": "2016-10-21 00:00:00", "mls_name": "CLAW", "price": "2894000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16173746", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Microwave", "RangeOven"], "street_address": "450 N SKYEWIAY RD", "description": "Tucked away on a serene street North of Sunset in one of the most sought after areas of Brentwood is 450 N. Skyewiay. This immaculate and ample traditional home has been meticulously maintained and richly appointed. The warm and inviting interior is highlighted by an expansive open floor plan and sophisticated architectural details including exposed beams, skylights and vaulted ceilings. The luxurious master suite includes a separate sitting area with marble fireplace, patio, large walk-in closet and sumptuous master bath with dressing area and over-sized soaking tub. Take in the stunning views of the ocean and historically significant Frank Lloyd Wright home across the street, while enjoying the fresh breeze from the master patio or deck. Manicured landscaping borders the perimeter of the home and the large rear patio is perfect for entertaining complete with BBQ and ornate fountain. Skyewiay provides an elegant reprieve in the city."},
{"bathrooms_half": "", "date_listed": "2016-10-21 00:00:00", "mls_name": "CLAW", "price": "2049000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16173754", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "RangeOven"], "street_address": "1023 S BUNDY DR", "description": "Romantic Spanish Hacienda hidden behind a tall privacy hedge. A true retreat full of old-world charm. 2 bedrooms, 2.5 baths plus a converted garage with office, den and ~ bath. Filled with natural light, archways, authentic tile detailing, hardwood floors and custom fixtures throughout. Arched living room with fireplace leads to formal dining room. Rustic chef's kitchen with stainless steel appliances and breakfast nook. Lovely master bedroom with luxurious bath. Tranquil and private backyard featuring a sparkling pool and lounge patio surrounded by lush landscaping. Move-in ready!"},
{"bathrooms_half": "", "date_listed": "2016-10-24 00:00:00", "mls_name": "CLAW", "price": "1195000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16173864", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "11863 DARLINGTON AVE", "description": "You immediately feel at home when you step into this luxurious 2 bedrooms and 2.5 bath condominium with an open floor plan and designer finishes. The living quarters features bamboo floors, crown moldings, gas fireplace, a large dining room and French doors leading out to a warm and inviting balcony. The ultimate kitchen has Jenn Air stainless steel appliances, granite counters, stone floors and a breakfast nook. Both bedrooms are en-suite with the spacious master suite complete with a custom dual walk in closets, all stone bath with double vanity sinks, oversize shower and a large soaking tub.The Gardens at Darlington has a fully equipped gym, gated parking, numerous guest parking spaces, conference room, lush garden courtyard with fountain and an inviting lobby with weekday concierge service. This home comes with a two car parking and large individual storage room.Located in the heart of Brentwood and just blocks from San Vicente's finest boutiques and restaurants"},
{"bathrooms_half": "", "date_listed": "2016-11-02 00:00:00", "mls_name": "CLAW", "price": "768000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16174184", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "4746 TOLAND WAY", "description": "Come discover an enchanting brick cottage in the heart of Highland Park. Once you step under the bougainvillea onto the flagstone porch, you'll be smitten. 4746 Toland Way was designed by LA architect Paul Hartman in 1936. It is an intact example of the bungalow style transitioning into the ranch style popular after WWII. The \"Mills Cottage\" is a registered LA Monument and Mills Act property. The home is abundant with original character; coved ceiling, glass doorknobs, & decorative heating grates. The dining room boasts a built in china cabinet and the den, which could easily be a third bedroom, has French doors that lead to the back patio, ideal for entertaining. The terraced lot has space to play and tremendous mountain views. Mature landscaping includes fruit trees, natives and multiple garden beds. The 1 car garage has direct access to the house and basement. Mills Act provides generous annual tax relief. Save thousands every year! Prepare to fall in love with this special home."},
{"bathrooms_half": "", "date_listed": "2016-10-24 00:00:00", "mls_name": "CLAW", "price": "1995000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16174228", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "1712 MANZANITA PARK AVE", "description": "Step into this beautifully designed home located at the end of a cul-de-sac nestled in the hills of Malibu. This peaceful and private oasis is tucked behind a walled courtyard entry and gated driveway. Once inside the home, you are met with views of the pristine and beautiful Santa Monica Mountains. Vaulted wood ceilings and a cozy fireplace make the living room a perfect place for entertaining. French doors off of the comfortable living room lead to an outdoor entertaining area featuring a stunning pool, spa, outdoor fireplace, exterior kitchen and huge deck. The ground floor includes a dining room, yoga studio, and master bedroom with expansive bathroom, vanity and walk in closets. An additional two bedrooms and laundry room are also downstairs. Upstairs is a one bedroom suite with sitting area, balcony, and bathroom."},
{"bathrooms_half": "", "date_listed": "2016-10-25 00:00:00", "mls_name": "CLAW", "price": "7350000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16174500", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "245 S BURLINGAME AVE", "description": "Truly a rare opportunity in Brentwood Park, minutes to the Country Mart, this charming Traditional has great scale and flow -- both indoors and out -- and is ideally suited for gracious living and entertaining. Secluded in a park-like setting w beautiful mature trees, this home was lovingly expanded and principally rebuilt. Spacious public rooms, include the living room w large windows overlooking the beautifully landscaped front gardens, and formal dining room w French doors that open to the large brick courtyard. High ceilings, crown moldings, hand finished hardwood floors and exquisite custom detailing throughout. Large cook's kitchen w butler's pantry opens to breakfast and family room. Walk-in wine cellar (redwood racking stores over 180 cases), game room w bar and office. Stunning master suite w fireplace, sizable bath and dual closets. Built-in BBQ and sparkling freshwater pool and spa. Unique slate roof. Detached 473 sq. ft.guest suite/gym w bath. 3 car garage w add. storage."},
{"bathrooms_half": "", "date_listed": "2016-10-26 00:00:00", "mls_name": "CLAW", "price": "2079000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16174642", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "235 OCEAN PARK", "description": "Spectacular 3 bed/3 bath + loft townhome located in the heart of Silicon Beach, Just one block from Main Street, and three blocks from the beach! This FAIA Award winning Michael Folonis creation has a sleek contemporary style, and is an entertainers dream. Featuring floor to ceiling windows providing tons of natural light, a large chef's kitchen and an expansive living room with a wood-burning fireplace. The master suite has a fully remodeled bathroom with high-end finishes, and its own generous outdoor sitting area. The open-air loft leads to a rooftop deck with beautiful ocean and city views highlighting the impressive location and building architecture. Other features include outdoor sitting areas off every bedroom, huge storage/flex space providing an additional 350+ sq. ft. beyond the published square footage and side-by-side parking inside a gated garage with the potential to park two additional cars. This unique end unit is a rare opportunity not to be missed!"},
{"bathrooms_half": "", "date_listed": "2016-10-25 00:00:00", "mls_name": "CLAW", "price": "16000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16174714", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "18326 CLIFFTOP WAY", "description": "Panoramic ocean views from this stunning, modern architectural home designed to perfection! Gorgeous open floor plan with high ceilings and skylights. The grand living room features walls of glass with amazing views of the Malibu coastline. The state of the art kitchen and exceptional indoor outdoor flow makes this home perfect for entertaining! The luxurious master suite includes sliding glass doors, huge walk-in closet and a spa-like bath. Enjoy the sunrises over Santa Monica and sunsets over Malibu. Live like you are on vacation!"},
{"bathrooms_half": "", "date_listed": "2016-11-10 00:00:00", "mls_name": "CLAW", "price": "3295000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16174844", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins"], "street_address": "11730 CHENAULT ST", "description": "Located in a highly desirable Brentwood location, this delightful Traditional home is filled with charm and character. Flooded with natural light, this home boasts three en-suite bedrooms upstairs, including the spacious master with fireplace. The formal living room with fireplace overlooks the front garden. The gourmet kitchen with Viking range opens to the family room with views of the lush backyard. Hardwood floors, beautiful windows and French doors, moldings and built in cabinetry are found throughout. Conveniently located downstairs is another en-suite bedroom. There is a detached artist studio/gym/office or playroom. Fenced and gated from the street, this peaceful haven is just minutes from shops and restaurants."},
{"bathrooms_half": "", "date_listed": "2016-10-27 00:00:00", "mls_name": "CLAW", "price": "7995000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16174878", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "701 N ALPINE DR", "description": "Elegantly situated in the heart of Beverly Hills sits this 2 story Mediterranean home w/ architectural details, 5 bdrms, 6 ~ bas & an inviting GH w/ add'l bedrm & bath. Enter thru the dramatic 2 story foyer to the beautifully appointed living room w/ frplc & music alcove, family/billiard rm w/ built-in book shelves & frplc, professional step-up bar & the formal dining rm that opens to the lushly landscaped bckyrd. Remodeled kitchen & adjoining den/brkfst area w/ French drs to the bckyrd, sunroom & an add'l bedrm suite complete the downstairs. Upstairs features a generous master bedrm w/ dual bathrm areas and walk-in closets & 3 add'l en-suite spacious bedrms. The sun filled private bckyrd features covered & uncovered patios, a sparkling pool/spa, a large grassy play area, covered sandbox & a detached GH w/ living & dining areas, kitchenette, bedrm & bath. The 2 car garage w/ work rm & pool bath complete the auxiliary structures. Come experience the grand essence of Beverly Hills."},
{"bathrooms_half": "", "date_listed": "2016-10-29 00:00:00", "mls_name": "CLAW", "price": "799000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16175522", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "5625 W CRESCENT PARK", "description": "Elegant contemporary two bedroom condo at the much sought after Metro in Playa Vista. Located on the 3rd floor, this unit has been impeccably maintained and was recently upgraded. Step into the formal entry way and you will find stone floors, a dine-in kitchen, a huge living room with a cozy fireplace, and a private patio. The sumptuous master suite includes two closets, dual sinks, and a soaking tub. The unit also includes an in-unit side by side washer and dryer and lots of storage. A great value in the booming Silicon Beach community!"},
{"bathrooms_half": "", "date_listed": "2016-10-28 00:00:00", "mls_name": "CLAW", "price": "3195000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16175808", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "609 11TH ST", "description": "Charming original Spanish style 3 bedroom + 1.75 bath single level home. Approximately 2,266 sq ft on a 50~150 lot with pool and converted garage. Tons of natural light, hardwood floors and original detailing throughout. Step-down living room with beamed ceiling, tile fireplace and built-ins. Large dining room opens to front family room/office/playroom. Bright kitchen with breakfast area. Master bedroom leads to a sunroom/office overlooking the private backyard. Sparkling pool and patio surrounded by mature landscaping. Large detached guest room with kitchen featuring fridge, stove and ~ bath. Roosevelt school district."},
{"bathrooms_half": "", "date_listed": "2016-10-31 00:00:00", "mls_name": "CLAW", "price": "899000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16175946", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "7463 ROSEWOOD AVE", "description": "Beautifully renovated character Spanish Bungalow in amazing Melrose Village (90036) location. Living room w/ barreled ceilings, formal dining room, newer hardwood floors, wood burning fireplace, newer central HVAC, large eat-in updated kitchen w/ center island & stainless steel appliances, updated bathroom, some newer windows, copper plumbing, updated electrical panel, newer roof, bolted foundation, tankless water heater, adorable patio/garden, & 1 car garage. Phenomenal location seconds to The Grove, Farmers Market, Trader Joes, Melrose Village, WeHo, Pan Pacific Park, Fairfax Village, & the very best shopping, restaurants, cafe's, boutiques, culture, entertainment and fun that LA has to offer! See private remarks for showing times."},
{"bathrooms_half": "", "date_listed": "2016-11-01 00:00:00", "mls_name": "CLAW", "price": "3550.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16176498", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave", "RangeOven"], "street_address": "610 N Orlando AVE", "description": "Extensively Remodeled Units for Lease in prime and hip WeHo! Modern designer finishes include French Oak laminate wood flooring throughout, a kitchen complete with stainless steel appliances, Caesarstone counters and backsplashes, and new custom cabinetry. This spacious unit features 2 bedrooms, 2 updated baths appointed with oversized showers, in unit laundry, Nest thermostat, and gated parking. Located a block from Melrose, which offers world class shopping, dining, and other facets of entertainment."},
{"bathrooms_half": "", "date_listed": "2016-11-03 00:00:00", "mls_name": "CLAW", "price": "1368000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16177116", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Oven"], "street_address": "11435 BIONA DR", "description": "Beautiful Four Bedroom + Studio home. Located on a Corner Lot. Warm & inviting spacious living room filled w/ character touches such as peg & groove hardwood floors, wood beam ceiling and decorative fireplace. The cheerful kitchen with an abundance of cabinetry and counters flows seamlessly into open dining area & outdoor patio, all ideal for entertaining family & friends. 4 generous Bedrooms peacefully tucked away from the common areas. Large master suite features high ceiling, 2 glass door closets and en-suite bathroom. Studio / Bonus room w/ bath, ideal as Music studio or Guest suite. Work on hobbies or weekend projects in the oversized two car garage complete with workbench and abundance of storage! Enjoy fresh tomatoes and peppers in the enchanting rear yard or relax in the hot tub after a long day. This home offers a serene setting in a prime neighborhood, close to Farmers Market, Mar Vista park, shopping & eateries. Make sure to see this Spectacular Home!"},
{"bathrooms_half": "", "date_listed": "2016-11-04 00:00:00", "mls_name": "CLAW", "price": "2649000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16177234", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "849 S BROADWAY", "description": "From the unprecedented Penthouse Collection of actor, producer, musician and real estate investor Johnny Depp comes this two story, 2 bedroom/3 bath residence featuring 2,400 square feet of vibrantly-decorated interiors that echo the decadent, Art Deco-style of the landmark Eastern Columbia Building in Downtown Los Angeles. Hardwood flooring and soaring ceilings command the open-plan great room, which plays host to a kitchen with stainless-steel Viking appliances, large center island, and original iron-clad windows facing the home's outdoor courtyard. The upper level offers two en-suite bedrooms as well as skyline views extending all the way to the Staples Center, the entertainment pulse of the city. Those residing in Los Angeles's most architecturally significant residential high-rise can also enjoy access to the building's leisure terrace which includes a saltwater pool and spa, sundeck, and fully-equipped fitness studio."},
{"bathrooms_half": "", "date_listed": "2016-11-04 00:00:00", "mls_name": "CLAW", "price": "2750000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16177260", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "849 S BROADWAY", "description": "From the unprecedented Penthouse Collection of actor, producer, musician and real estate investor Johnny Depp comes this two story, 2 bedroom/3 bath residence situated within Los Angeles's most architecturally significant residential high-rise in Downtown's historic core district. Affording 2,266 square feet of interiors, the home also plays host to an outdoor terrace providing direct access to the landmark Eastern Columbia Building's magnificent sky deck featuring a saltwater pool and spa, sundeck, and fully-equipped fitness studio. Linoleum floors are present throughout, beginning in the great room where soaring ceilings and a fully-outfitted kitchen with center island set the stage for the home's main living area. Climbing the steps of the red metal staircase is bold, checkered pattern flooring that energizes the entire penthouse. Here, on the upper-level landing, an exposed brick wall leading to the en-suite bedrooms is interrupted by a window offering views of the rooftop pool."},
{"bathrooms_half": "", "date_listed": "2016-11-04 00:00:00", "mls_name": "CLAW", "price": "1999000.00", "bedrooms": "1", "bathrooms_full": "", "mls_id": "16177272", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "849 S BROADWAY", "description": "From the unprecedented Penthouse Collection of actor, producer, musician and real estate investor Johnny Depp comes this two story, 1 bedroom/2 bath residence sitting atop the landmark Eastern Columbia Building. Towering over the great room and adding a sense of dreamy playfulness to the 1,780 square foot loft is the captivating wall mural featuring Brazilian street artist Osgemeos. Situated between the mural and the fully-equipped kitchen is a tile-clad dining table that can accommodate over a dozen guests. Soaring ceilings elevate the striking presence of the metallic, Art Deco-style chandelier presiding from above. Before continuing upstairs to the master suite, one is provided with a cozy and intimate lounge area on the staircase landing. Those residing in Los Angeles's most architecturally significant residential high-rise can also enjoy access to the building's leisure terrace which includes a saltwater pool and spa, sundeck, and fully-equipped fitness studio."},
{"bathrooms_half": "", "date_listed": "2016-11-03 00:00:00", "mls_name": "CLAW", "price": "650000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16177332", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Microwave"], "street_address": "3850 GLENALBYN DR", "description": "Impeccable home!!! Tons of upgrades!!! Remodeled kitchen with stainless steel appliances and granite counter tops. 2-car attached garage. Zoning is possible for backyard expansion. Lots of possibilities!! Newly built deck and fencing for entertainment. Breath taking mountain views and sunset. Buyer to verify sq. ft. in the house."},
{"bathrooms_half": "", "date_listed": "2016-11-03 00:00:00", "mls_name": "CLAW", "price": "1285000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16177368", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "RangeOven"], "street_address": "11017 WAGNER ST", "description": "Sensational home in the coveted Vets Park neighborhood. A true move-in ready, opportunity. Meticulously maintained. Features include, oak flooring, large master suite, bright kitchen with breakfast nook, traditional dining and living rooms, wired music throughout, abundant natural light throughout home, built-ins, forced air heat, central cooling, and exceptional detailing. Large master with two separate closets, shower/steam room with dual showerheads, whirlpool tub. Flagstone entry, covered patio with overhead heater, built-in BBQ and lighting."},
{"bathrooms_half": "", "date_listed": "2016-11-04 00:00:00", "mls_name": "CLAW", "price": "1565000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16177590", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "849 S BROADWAY", "description": "This two bedroom residence located in Downtown L.A.'s landmark Eastern Columbia Building has been completely reimagined by designer/architect Andrea Keller, drawing its design inspiration from Havana, Cuba with a dose of Hollywood Regency. Vintage pieces, such as Art Deco panels from the 1933 World's Fair, along with original reproductions, fill the spaces with enviable charm. A sound reduction wall together with columns and matching pilasters offer a relaxed, clubby vibe in the expansive main living area. The kitchen wow's with its custom backsplash made by Ann Sacks tile, Onyx Jade countertops, and full entourage of Northstar appliances, their mint green coloring and chrome finish making a bold, 1950's throwback statement against the neutral cabinetry. Residents of Los Angeles's most architecturally significant residential high-rise can also enjoy access to the building's leisure terrace which includes a saltwater pool and spa, sundeck, and fitness studio."},
{"bathrooms_half": "", "date_listed": "2016-11-11 00:00:00", "mls_name": "CLAW", "price": "1188000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16178020", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "1290 OAKWOOD DR", "description": "Come away to this enchanting cottage in an idyllic, creekside setting to escape the city hustle and relax. Verdant green lawns surround you as you stroll up the stone path to this two bedroom, two bath hideaway on almost an acre. The master suite opens to an enclosed greenhouse style patio. Have a soak in the master bath spa tub or unwind in your private sauna. The second bedroom opens to the sky-lit family room with wrap around deck. In the living room, snuggle in front of the rock fireplace which contains a warming stove. Dine al fresco on the front dining deck, situated through french doors off the generous kitchen. Meander through the garden pathways to the dining pergola, set creekside. Make your own meditation spot under the majestic oak that appears to magically rise straight out of a boulder. Separate studio structure offers many options. Plenty of parking on this street to street lot. Five parcels included in sale. Buyer to verify square footage."},
{"bathrooms_half": "", "date_listed": "2016-11-07 00:00:00", "mls_name": "CLAW", "price": "395000.00", "bedrooms": "1", "bathrooms_full": "", "mls_id": "16178144", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "1730 CAMINO PALMERO ST", "description": "Great opportunity! 1 bedroom/1 bathroom condo, mins From the 101 & Hollywood Blvd. Well maintained cherry wood cabinets with stainless steel appliances. Double deep sink with modern Moen faucet & chrome extension hose sprayer for easy washing. Spacious travertine tiled bathroom with bathtub & shower. Spacious dining room is adjacent to kitchen."},
{"bathrooms_half": "", "date_listed": "2016-11-08 00:00:00", "mls_name": "CLAW", "price": "30000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16178498", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "6237 BONSALL DR", "description": "A prime flat ~1.5 acre lot w/ a unique use of modern finishes & innovative design by Vitus Matare. This private gated single story marvel is adorned w/ mature trees ranging from avocados to evergreens. The indoor/outdoor flow is seamless w/ spectacular outdoor features including 3 fire pits, an animal paddock, outdoor shower, raised garden beds, orchard & open lawn spaces. Upon entering it is easy to be overwhelmed by the use of steel, 70 year old hand hewn wood & radiant heat concrete flooring. This home exemplifies exceptional lines & ideal floorplan, high windows & use of petrified wood. Designed to be an entertainer's paradise. Located on one of Malibu's MOST desired streets w/ coveted underground access to Zuma Beach & state parkland for horse riding and hiking. In addition to the main residence there, is a 798 sq/ft detached garage/workshop, a detached bonus structure, and more. Also available for sale at $6,649,000. Buyer to verify sq/ft. *Agent see private remarks."},
{"bathrooms_half": "", "date_listed": "2016-11-11 00:00:00", "mls_name": "CLAW", "price": "3695000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16178844", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven"], "street_address": "1 EASTWIND ST", "description": "Rising tall over a rare stretch of soft sand in Marina Del Rey, this epic Lorcan O'Herlihy-designed two level penthouse offers nearly 800 square feet of outdoor terrace including a rooftop lounge evocative of an exclusive members' club. A union of soaring ceilings and awe-inspiring blue horizon vistas, one feels instant serenity among this home's newly reimagined interiors. Two story walls of glass guide light to every surface, highlighting a gourmet kitchen, generous living space, dining quarters, a rear bedroom and lofted lounge. Spaces are outfitted with surf chalet-inspired finishes including an eclectic variety of fine woods, a white antler-inspired chandelier and stone slat fireplace. Welcome each day on top of the world in a remarkable master second-floor suite overlooking Venice pier to the west and a rich wood-cloaked terrace to the east, complete with a raised firepit, outdoor kitchen and adjoining third bedroom, office or gym."},
{"bathrooms_half": "", "date_listed": "2016-11-09 00:00:00", "mls_name": "CLAW", "price": "6495.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16178870", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Range Hood", "RangeOven"], "street_address": "255 MAIN ST", "description": "One of a kind 2 bedroom, 2 bath modern penthouse with loft plus ocean views. This New York style Penthouse has high ceilings, lots of natural light, and a sunken living room with fireplace! The open floor plan with wood/bamboo floors & 3 patios, makes this unit stand out from the rest! Only 1 block from the beach, with pool, spa, and Fabulous location on Main Street with shops, restaurants, yoga studio & more. Unit comes with 2 parking spaces in the underground gated garage, with ample guest parking."},
{"bathrooms_half": "", "date_listed": "2016-11-11 00:00:00", "mls_name": "CLAW", "price": "1795000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16178966", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "RangeOven", "Oven"], "street_address": "942 VENEZIA AVE", "description": "Impeccably updated Spanish Modern in the heart of Venice Beach. A tall secluded hedge welcomes you to the grassy front yard and porch. A wide-open floor plan, live edge center island and large grassy back yard with lounge area, invites a casual entertaining lifestyle. Thoughtfully remodeled throughout, this turn-key home is ideal for Venice Beach living. West of Lincoln Blvd and central to all the incredible boutique shops and restaurants, such as Superba Food and Bread, Late Sunday Afternoon and Cristy Dawn."},
{"bathrooms_half": "", "date_listed": "2016-11-10 00:00:00", "mls_name": "CLAW", "price": "1749000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16179108", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven", "Oven"], "street_address": "1760 WELLESLEY DR", "description": "Don't miss this impressive 2,510sqft traditional located on a corner lot in Sunset Park. Perched up on top of the hill, this home has great views from the second level master suite. There are three additional bedrooms downstairs with two bathrooms. The remodeled kitchen has tons of counter space and cabinets and it opens up to the adjacent living room. This home has lots of windows that were recently replaced, making it extremely light and bright. Front yard was professionally landscaped with drought tolerant plants. Grant Elementary School!"},
{"bathrooms_half": "", "date_listed": "2016-11-11 00:00:00", "mls_name": "CLAW", "price": "749000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16179426", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "RangeOven", "Built-In And Free Standing"], "street_address": "330 S BARRINGTON AVE", "description": "2+2 beautifully updated condo, located on the back of the complex and overlooking the park-like wooded area owned by the VA. This is a very idyllic and tranquil location that is convenient to everything, including Brentwood's finest restaurants, shops, and Whole Foods. There is a dog park close by, and the Barrington Rec Center is across the street whose facilities include: Tennis Courts, Basketball Courts, Baseball Diamond, Children's Play Area, Football/Soccer Field, and Picnic Tables."},
{"bathrooms_half": "", "date_listed": "2016-11-11 00:00:00", "mls_name": "CLAW", "price": "1100000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16179532", "rooms": [], "appliances": [], "street_address": "5340 DENNY AVE", "description": "Approved 8-Unit construction project in the NoHo Arts District. The Project is stamped \"Ready-to-Issue\" and ready to go. A stone's throw from everything that the North Hollywood Arts District has to offer, this project is surrounded by restaurants, bars, shops, a movie theater, a huge gym and a couple dozen playhouses. Within a very short distance to the Metro Subway Red Line and the High-Speed Orange Bus Line and almost next door to the Chandler Bikeway, this property is perfect for the crowd who would rather have the option of public transportation or getting around by bicycle. Large homes and fully parked."},
{"bathrooms_half": "", "date_listed": "2016-11-11 00:00:00", "mls_name": "CLAW", "price": "1650000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16179540", "rooms": [], "appliances": [], "street_address": "5625 CASE AVE", "description": "Bring your Developers! This property is perfect for a Small Lot Subdivision. Build 10 Units by Right. The site is made up of two full lots and a bit more for a total of over 16,000 square feet. With the RD1.5-1VL zoning, this is a great opportunity to build SLO single family homes in a very desirable pedestrian friendly neighborhood a stone's throw to the Metro Subway Red Line and High-Speed Orange Bus Line. With the proximity to the Chandler Bikeway, restaurants, bars, shops, supermarket, movie theater, playhouses and huge gym, you can't go wrong. Sale includes 3 APNs: 2337-029-021, 2337-029-022, 2337-029-004"},
{"bathrooms_half": "", "date_listed": "2016-11-14 00:00:00", "mls_name": "CLAW", "price": "3986000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16179602", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Microwave", "RangeOven"], "street_address": "2919 GRAYSON AVE", "description": "Embodying the relaxed casual elegance and privacy of a European-style compound, this exquisitely designed contemporary home on a tree-lined Venice street is the realization of every coastal California dream. A breathtaking entertainer's courtyard flowing from a beautifully appointed chef's kitchen is the true heart of the home. A large sparkling saltwater pool is encompassed by a flagstone terrace and lush flora, with an array of inspired spaces for relaxation and entertaining, including a spacious sundeck, fire pit lounge and entertainer's villa. The master suite includes its own sunroom, spa-like bathroom and light-filled living room, with a spiral staircase leading to a generous rooftop dining terrace. Authentic to its core, the home is swathed in ornate and original details, from hand-carved Canterra stone window sills to solid maple trim. With privacy, elegance and proximity, this home is truly a catalyst for a full and fruitful life."},
{"bathrooms_half": "", "date_listed": "2016-11-16 00:00:00", "mls_name": "CLAW", "price": "1875000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16180182", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "Microwave", "RangeOven"], "street_address": "308 N SYCAMORE AVE", "description": "This exquisite corner residence within Los Angeles' most distinguished pre-war building embraces the forgotten elegance of old-world European design while affording the modern comforts of present day Los Angeles. The home's unrivaled location offers tree-top side street views, reminiscent of Manhattan's Upper East Side, while the best of Hancock Park's dining and shopping awaits moments away. A medley of 15th through 17th-century design, the interior spaces are swathed in ornate details, including French art deco-style doors with large centered knobs. Experience surmounting awe from the spacious entryway to the generous master suite with private foyer, walk-in closet and marbled and mirrored dual-vanity bath-a prize of true Hollywood glamour. Deemed an L.A. historic monument in 2009, the French Normandy-style Faubourg St. Denis is a charming, landmark building with full modern amenities, including an immense swimming pool and subterranean parking."},
{"bathrooms_half": "", "date_listed": "2016-11-17 00:00:00", "mls_name": "CLAW", "price": "1125000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "16180298", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven", "Gas/Electric Range", "Range Hood", "Self Cleaning Oven"], "street_address": "731 N CHESTER AVE", "description": "This 1913 Craftsman is situated in the highly sought after Bungalow Heaven district. The home evokes the soul of vintage craftsman with thoughtful upgrades for modern living.The living room has a fireplace and spacious dining area. The cook's kitchen is filled with natural light, custom cabinets, stainless steel appliances, granite counter tops and glass tile back splash and opens to the family room. The Master suite has a fireplace and french doors opening to the peaceful back yard. Two additional bedrooms share a fully updated bathroom. The backyard features drought resistant landscaping. Newly remodeled yoga studio is designed to accommodate exercise room or office. Turnkey home is conveniently located to fabulous shopping, dining and cultural venues."},
{"bathrooms_half": "", "date_listed": "2016-11-18 00:00:00", "mls_name": "CLAW", "price": "839000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "16181224", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "RangeOven"], "street_address": "4714 LA VILLA MARINA", "description": "Exquisitely renovated multilevel mid century town home 2 + 2.5 end unit with bonus office/nursery. Open floor plan. Spacious kitchen with stainless steel sink, oven and dishwasher. Cozy secluded patio off kitchen, great for outdoor dining. Built in bar cabinetry and sitting area. Formal dining area flows to spacious living room with gorgeous gas fireplace, recessed lighting and bamboo floors. Large master suite with stunning high-arched ceilings, ocean breezes and balcony overlooking gardens and pool. Cozy office or nursery with bamboo floors, recessed lighting and natural light from two large Velux skylights. Second bedroom with full bath. Washer & dryer in unit. Majority of the windows are energy efficient dual pane. 2 car side by side attached garage with adjacent large storage area. Close to movie theaters, restaurants and shopping."},
{"bathrooms_half": "", "date_listed": "2016-11-18 00:00:00", "mls_name": "CLAW", "price": "7488000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16181228", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Built-Ins", "Range Hood", "RangeOven"], "street_address": "33583 MULHOLLAND HWY", "description": "Set to awe-inspiring ocean views and soaring sandstone mountain peaks, this striking home, built by world-renowned Architect Ed Niles, affords the rare opportunity to live within the majesty of nature's beauty while moments from the best of Los Angeles. With an abundance of glass supported by steel, the single story main residence takes in 360-degree views of its natural surrounds, with ceilings meeting the sky at a grand 22 feet. A secluded retreat, the 16-acre property is conveniently situated in the hills of Malibu on the infamous Mulholland Highway, and includes a working helipad to make travel a breeze. Adjacent the lower level swimming pool and sauna space with a separate entrance, a generous guest house, currently used as a music room, rounds out a total of approximately 7,000 square feet of living space - destined to house the idyllic life you've always imagined."},
{"bathrooms_half": "", "date_listed": "2016-01-07 00:00:00", "mls_name": "CLAW", "price": "2879000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "16968013", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Range Hood", "RangeOven"], "street_address": "828 BALLARD CANYON RD", "description": "Meticulously maintained historic 5-acre horse ranch nestled in the wine country of the Santa Ynez Valley combines exquisite craftsmanship with an artful blend of rustic wood, warm stone, and bronze touches. The great room is spanned by a bold open truss ceiling and paved with stone underfoot, while its open concept kitchen features farm sink, stone countertop + distinctive designed backsplash. The oversized master bedroom is wrapped in walls of glass, includes a massive stone fireplace, walk-in closet, large shower & a luxurious soaking tub. Three additional bedrooms, one which functions nicely as a second master suite. All bedrooms have vaulted ceilings and Brazilian cherry wood floors. Outdoor entertaining around pool, waterfall, spa, outdoor wood-fired pizza oven. As befits a ranch that bred, raised and trained Palomino horses, the equestrian facilities are extensive: center aisle barn with office, tack room + bath, shed row barn, arenas + pastures, 3-car garage, fruit orchard."},
{"bathrooms_half": "", "date_listed": "2016-01-13 00:00:00", "mls_name": "CLAW", "price": "599000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "16970717", "rooms": [], "appliances": [], "street_address": "5880 Foxview DR", "description": "Amazing white water, ocean view lot in gated community. Very private road. Multi-Million dollar homes on street. Gorgeous coastline Views. Huge up-side for the right buyer. Per Seller - Home may have abandoned well/water tank. Home is in proposed Trancas Highlands Water System Project area. Buyer to investigate with city of Malibu. Homes in Trancas Highlands are maintained by the Trancas Highlands Homeowners Association. Most homes have water tanks on the property, and rely on wells and imported water for their needs. The Homeowners Association is currently trying to form a water district to extend municipal water service from Trancas Canyon Road near Malibu West to these residences. Wastewater is treated in on site septic tanks, utilities are both above and underground."},
{"bathrooms_half": "", "date_listed": "2016-01-20 00:00:00", "mls_name": "CLAW", "price": "45000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "16970871", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Microwave", "RangeOven", "Cooktop - Gas", "Double Oven"], "street_address": "6692 WILDLIFE RD", "description": "New Construction Point Dume Rental with coveted Beach Rights available immediately. This amazing, designer perfect, super private/secure home comes fully furnished and is available immediately. Book monthly or longer term. Want a sophisticated beach get-away that is secure and large enough for an extended family or large staff? This is it. The home features 6 bedrooms, 6 Bathrooms, and a large office in the main house, plus a fully functional and separate 1 bedroom + 1 bath guest/pool house. Rare for the area, this newer construction home has a massive back yard with pool and spa, plus key rights to Little Dume Beach (and a golf cart to get you there). You will be hard pressed to find a better Point Dume rental that is this new, this large, this cool, with beach access this good. Too many cool details to list, please see the photo tour for the full picture of this amazing home."},
{"bathrooms_half": "", "date_listed": "2015-10-09 00:00:00", "mls_name": "ITECH", "price": "658900.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "315010127", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "2148 Dorado Drive", "description": "House was taken down to the studs, has no plumbing and no electrical and only sub-flooring in some of the rooms. Single level property in a great neighborhood, located in the gentle hills of Rancho Palos Verdes."},
{"bathrooms_half": "", "date_listed": "2016-02-04 00:00:00", "mls_name": "ITECH", "price": "4699999.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "316000525", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven", "Range Hood"], "street_address": "845 Highland Drive", "description": "Unbelievable custom home in the hills of La Canada Flintridge! The home sits peacefully on a multi-level 40,000+ square foot lot and is extremely private with beautiful views of the mountains. Entertaining is fabulous with its grand Living and Dining Room with walls of glass, enormous over-sized brick fireplace, exposed 18 foot ceilings, antique glass lanterns and large covered porch. In total the home has over 50 SF of original art from Judson Studios-one of the world's leading glass art studios, imbedded in its very architecture. The kitchen is incredible with unique granite and copper sinks, professional appliances, hand-crafted cabinetry and breakfast area. Off of the kitchen is an outdoor cooking and entertaining pavilion with an Argentine Asador Grill. The sprawling yard is complimented with a large rose garden, pool, spa, grass area and numerous trees. This home is absolutely unique and spectacular with incredible details throughout! Come on home to your own retreat!"},
{"bathrooms_half": "", "date_listed": "2016-05-05 00:00:00", "mls_name": "ITECH", "price": "6495000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "316004149", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas", "RangeOven"], "street_address": "887 Flintridge Avenue", "description": "Absolutely exquisite Spanish Colonial Revival Estate located in the heart of Flintridge. Former Showcase House magnificently situated on almost 2 flat acres of private park-like grounds with multiple grassy areas, lush foliage, elegant pool and spa with expansive brick inlaid outdoor patios that overlook the tranquil gardens and stunning mountain views. This truly rare offering features all the aesthetic details of a timeless architectural masterpiece with original Batchelder tiles, gleaming hardwood floors and stunning custom details. High ceilings throughout are highlighted by multiple floor to ceiling windows and French doors that flow out to the limitless patio area for gracious indoor-outdoor entertaining year round. Beautifully expanded in 2006 with a romantic new master suite and grand/open gourmet kitchen-family room. Extravagant grounds offer a sprawling motor court, Porte-Cochere, state of the art septic system with 200,000 gallon capacity, room for a tennis court and or sport court plus more. This incredible private, yet close to all compound is an absolute rare find. Award winning La Canada Schools."},
{"bathrooms_half": "", "date_listed": "2016-06-22 00:00:00", "mls_name": "ITECH", "price": "919000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316005809", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "64 North Arroyo Boulevard", "description": "Meticulously maintained light-filled townhouse in the Altos Arroyo complex is looking for its next owner. Main floor features hardwood flooring throughout, living room with vaulted ceilings and fireplace, formal dining room with French doors leading to enclosed patio, eat-in kitchen with updated appliances and individual laundry room. A wet bar is conveniently located between the dining room and living room, ideal for entertaining. Completing the downstairs is the 4th bedroom with French doors to patio, currently being used as an exercise room, and 3/4 bath. Upstairs features a master bedroom suite with fireplace, 2 walk-in closets, oversized bath with double sinks, shower and separate tub. Two more bedrooms share a full bath. Park in one of your 2 attached single car garages with ample storage and take your personal elevator with stops on each floor. Gated community features mature landscaping, pool, spa and guest parking. Close proximity to Rose Bowl, Old Town Pasadena and freeways."},
{"bathrooms_half": "", "date_listed": "2016-06-22 00:00:00", "mls_name": "ITECH", "price": "2700000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316005875", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Double Oven", "Gas"], "street_address": "899 Winston Avenue", "description": "Located on a quiet street in the desirable San Marino neighborhood, is this charming and cheerful traditional. It boasts 3 beds and 3 baths downstairs, and a private bedroom suite upstairs. Inviting curb appeal and immaculate front yard takes you to the formal entry, adjacent is an intimate and sun-lit living room with a fireplace, overlooking the pool and pergola through the sliding doors. Formal dinning room opens to a spacious and light-filled kitchen with built-in refrigerator, eating area, and a built-in desk. The adjoining family room has high vaulted beam ceiling and a fire place, with the view of the private backyard hedged by towering Italian cypress trees, bricked patio, newly planted flowers and trees, a sparkling pool and spa, beautiful light in the late afternoon."},
{"bathrooms_half": "", "date_listed": "2016-07-15 00:00:00", "mls_name": "ITECH", "price": "1988000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "316006132", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Oven", "RangeOven"], "street_address": "1401 Via Del Rey", "description": "Mid Century 1970's iconic Charles Wong designed South Pasadena home, filled with original character and charm, situated on a corner lot atop of Via del Rey, overlooking Pasadena, the Rose Bowl and a grand view of the San Gabriel Mountains. Intricately etched double door entry welcomes you onto the top floor of this unique sprawling home surrounded by large floor to ceiling windows. Spacious living room accented by wood beamed ceiling, fireplace and built-in cabinets. Updated kitchen highlighted with an abundance of cabinetry, counter-top space, separate wok burner, two dining areas plus an adjacent family room. Upper level is complete with a master suite, four generous bedrooms all with distinctive features such as custom closets and built-ins. Beautiful center spiral staircase takes you to the bottom level equipped with laundry room, expansive multipurpose room, office, fitness room, additional en suite bedroom, entertainment room with bar and access to attached three car garage, as well as RV parking space in rear. This exceptional one of a kind home has been lovingly maintained by its original owner."},
{"bathrooms_half": "", "date_listed": "2016-07-04 00:00:00", "mls_name": "ITECH", "price": "2488000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "316006255", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "2806 Glendower Avenue", "description": "Incredible opportunity! Absolute Best VALUE above the Blvd with SPECTACULAR VIEWS!! Stunning custom contemporary view home situated on one of the premier streets in Los Feliz. An architectural gem which offers a versatile open floor plan with soaring ceilings and grand picture windows designed to maximize the spectacular unobstructed views of the city and Observatory. This sophisticated home features large scale rooms with multiple options for luxurious indoor and outdoor entertaining including an upper floor game room that opens up to a stylish roof top deck. Additional amenities include a gorgeous master suite with sensational views, media room, gym, dry sauna, large guest quarters with full bath and kitchenette, formal living and dining rooms with a well appointed gourmet kitchen. The large 3 car garage has direct access and expansive storage. Ultra private backyard exudes tranquility with lush landscape with ample space for alfresco dining and relaxation. Generous sized guest/in law quarters with separate entrance, full bath and kitchenette. Close to shops, restaurants, hiking trails and all that the Los Feliz lifestyle has to offer. This home truly has it all and is Priced to Sell!!"},
{"bathrooms_half": "", "date_listed": "2016-09-02 00:00:00", "mls_name": "ITECH", "price": "1898000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "316006757", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "764 Michigan Boulevard", "description": "The Prairie style architecture of this magnificent home, with its broad eaves, pergola covered porte-cochere and expansive front porch, welcome you home to the tree-shaded parkways and expansive lawns of Michillinda Park. Turn-of-the-century Craftsman details are found throughout the home including: quarter-sawn oak pocket doors and tapered columns, a formal dining room with built-in buffet, wood detailing and box-beam ceiling, and a staircase with box newel posts and detailed balustrades. The downstairs includes a formal entry, living room with leaded glass cabinetry, bay window with sitting bench, and massive original Batchelder fireplace, formal dining room, remodeled kitchen with rich cabinetry, granite counters and center island, family room with coffered mahogany ceiling, fireplace, wet bar and built-in entertainment center, guest bath and a laundry room. The upstairs offers five bedrooms, three baths, two additional fireplaces, a massive library-esque landing with built-in bookcases and a large walk-out balcony to enjoy the warm summer evenings. The park-like grounds of almost one-half acre allow room for entertaining with a fenced pool area and expansive backyard."},
{"bathrooms_half": "", "date_listed": "2016-07-29 00:00:00", "mls_name": "ITECH", "price": "1848000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316007195", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "5215 Vista Miguel Drive", "description": "Quintessential Cape Cod style home located in a prime area of La Canada Flintridge. Fantastic family floor plan with sunlight-filled rooms throughout which flow seamlessly to an inviting veranda and expansive lower level brick patio for gracious indoor-outdoor living. This lovely home offers 4 well appointed bedrooms (3 on the main level and 1 down) with 3 full bathrooms. A lower level has a separate entrance with a large family/game room, fire place, spacious 4th bedroom, full bath, kitchenette & laundry room. Additional features include a beautiful updated kitchen with granite counters, breakfast bar and spacious nook, formal living room with fire place, formal dining room and cozy family room all on the mail level. Gorgeous, professionally landscaped park-like front and back yards are perfect for relaxation and alfresco dining. Dual zones for heating and air, security system and a 2 car garage with direct access further enhance this home. Truly a property that exudes character and charm. Close to shops, restaurants and award-winning La Canada Schools."},
{"bathrooms_half": "", "date_listed": "2016-08-03 00:00:00", "mls_name": "ITECH", "price": "1450000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316007323", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas"], "street_address": "470 South Santa Anita Avenue", "description": "Special two-story Spanish Colonial Revival featuring Andalusian architectural details. Separate single-story wing dedicated to large living room with vaulted ceiling supported by trussed wooden beams, oak floors, distinctive fireplace, and French doors opening upon loggia's sheltered sitting area surrounded by tranquil walled garden. 2,938 sq ft interior with 4 bd/3ba on freshly landscaped 8,629 sq ft lot. Recent remodeling and system updates all in stylistic accord with original 1927 architectural intention. Kitchen remodel includes Expressions in Wood'' custom cabinetry, large center island mahogany topped breakfast bar, walk-in pantry, granite countertops, tile backsplashes, abundant storage, built-in appliances: Thermador cooktop, convection and gas ovens, KitchenAid refrigerator, GE Profile microwave. Downstairs bathroom remodeled utilizing vintage-style fixtures. Newer central A/C, heat, and ductwork, full copper repipe, foundation bolted, Tuscan lime wash applied to exterior, updated electrical throughout, newer recessed lighting, and 200-amp electrical service. 2-year-old water heater. New alarm system. Wood floors have been refinished, as has the entryway's magnesite."},
{"bathrooms_half": "", "date_listed": "2016-09-06 00:00:00", "mls_name": "ITECH", "price": "1088000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316007560", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Oven", "RangeOven"], "street_address": "1406 Wellington Avenue", "description": "Located in the prestigious Linda Vista neighborhood of Pasadena, this adorable home welcomes you with a beautifully landscaped front yard and charming porch. Cozy living room with fireplace, wood beamed ceiling and access to quaint,relaxing patio. Kitchen is centrally located and adjacent to formal dining room with views of the newer manicured yard. Functional laundry room with large counter top and built in ironing board. Master suite with custom closet, attached bath and French door leading to picturesque backyard. The home is located amongst larger estate homes with abundance of curb appeal and pride of ownership. Close to museums, Rose Bowl, Brookside Golf Course and Old Town Pasadena."},
{"bathrooms_half": "", "date_listed": "2016-08-15 11:31:13", "mls_name": "ITECH", "price": "879000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316007701", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Electric", "Microwave"], "street_address": "82 Monterey Lane", "description": "Quaint Sierra Madre Traditional corner lot home on cul-de-sac street. Wonderful open and bright floor plan with 3 bedrooms, 2 bathrooms, and spacious family room that opens to the back yard. This home has a large living/dining room with charming fireplace, the family room flows off the kitchen (w/granite counters) with large in kitchen eating area. Central A/C, gleaming hardwood floors, Anderson windows throughout and laundry room. There is a spacious enclosed backyard and detached 2 car garage. Located on a very quiet street near the Sierra Madre Recreation Center/playground, dog park, community pool and tennis courts and Sierra Madre Middle School."},
{"bathrooms_half": "", "date_listed": "2016-08-19 00:00:00", "mls_name": "ITECH", "price": "799000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "316007842", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Gas"], "street_address": "21552 Yucatan Avenue", "description": "Beautifully remodeled five bedroom, three bath home located south of the Blvd. This home exemplifies an ideal open floorplan, soaring ceilings & an abundance of natural light. Features include a cooks kitchen with stainless steel appliances and large island, living room with vaulted ceilings and fireplace, den, bedroom, guest bath and laundry room. Private master suite located on the upper floor is accentuated with ample closet space and en suite with a dual vanity & large glass shower. Three additional bedrooms and remodeled bath complete the space. Large office and direct access to the garage are conveniently situated off of the entry. A peaceful tree lined street, landscaped yard and striking curb appeal complete this very special home!"},
{"bathrooms_half": "", "date_listed": "2016-08-24 00:00:00", "mls_name": "ITECH", "price": "850000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316007976", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "3138 Cloudcrest Road", "description": "Peace, calm and quiet in the hills of La Crescenta, this Traditional-Contemporary home offers what you've been waiting for. Within the last two years this three bedroom,/two bathroom home has been extensively updated. The kitchen has glorious mountain views, honed basalt floors, quartz counters and Kitchen Aid Stainless appliances. The Master Suite opens to the trellis patio and back yard and makes for a private retreat. Both baths have been remodeled along with new Milgard windows, ceiling fans,interior hardware, security system with 4 cameras, water heater, interior and exterior paint, landscaping and fountains are just a few of the incredible details. There's also a remodeled/finished (357 sf measured) basement not included in the square footage but truly a huge bonus to this very rare home! The Blue Ribbon School District tops it all off!"},
{"bathrooms_half": "", "date_listed": "2016-09-06 00:00:00", "mls_name": "ITECH", "price": "1790000.00", "bedrooms": "6", "bathrooms_full": "", "mls_id": "316008372", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Free Standing Gas", "Oven-Gas"], "street_address": "2388 North Altadena Drive", "description": "House Re-Imagined! It is incredible what can be done for $50K. Come and see the transformation. Canopies of Oaks shelter this one-of-a-kind Rustic Craftsman residence that rests on the banks of Eaton Canyon. Views of the San Gabriel Mountains and Canyon floor are evident from the home's many interior spaces and exterior patio areas that surround the property. Intimate seating areas include a river rock patio area with fireplace, river rock alcoves graced by old Oak trees, a canyon side patio with pond and fountain, all providing a very magical environment rarely found in the City. A bay of picture windows from the formal rooms provides the perfect space for restful entertaining. Other fine features include hardwood flooring, period fixtures, coved ceilings, and many original fine architectural elements. Generous sized formal rooms incl. living room and family room w/fireplace, formal dining rm. The flexible 6-bedroom floor plan lends itself well for the expanding family. New interior paint, new quartz kitchen counters and stainless steel hardware, etc. Truly a very special property."},
{"bathrooms_half": "", "date_listed": "2016-09-09 00:00:00", "mls_name": "ITECH", "price": "1349000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316008538", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas"], "street_address": "2329 Lake View Avenue", "description": "Designed by noted Architect, Steven Hill, this stunning example of contemporary modernism is bound to impress you. Perched on an expansive ridge in Silverlake Heights, this 2,100 Sf contemporary home is on a large unobstructed parcel. This stunning home enjoys the privacy of being surrounded by an additional 30,000 square feet of open land. Built in 1998 with unique architecture that provides three levels of living space each level has sweeping views of Mount Washington and the San Gabriel Mountains. In addition to the 3 bedroom, 2 baths, a large private patio, balconies, decks and, an oversized garage, there is a shaded and secluded upper rear yard with a finished relaxation area offering endless possibilities to enjoy the beautiful Southern California outdoor living. Current owners have meticulously thought of every detail to achieve a highly functional home with modern aesthetic and amenities including: fresh paint inside and out; Bamboo Rustic wood floors installed in living areas; newer window screens and screen doors; slate installed in entry and living room fireplace; Newtechwood decking on all patio areas; newer mahogany front door; recently installed cedar in master closet; solar LED path lights."},
{"bathrooms_half": "", "date_listed": "2016-09-19 00:00:00", "mls_name": "ITECH", "price": "899000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316008853", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "1990 Hilldale Drive", "description": "Charming hilltop home! Built in 1941, this 3 bedroom 2 bathroom traditional 2 level home has been meticulously maintained by the current owners for the past 25 years and is described as having good bones'' and being well built. Gorgeous hardwood floors, dual pane windows, updated kitchen and baths, and bullnose plastered walls are just a few things that add to the nuance and character of this very special home. Close to Montrose Shopping Park, restaurants, grocery stores, UA Movie Theater and located in the award winning La Canada school district! Other highlights include: 675 SF of foundation storage Hardwood under carpet upstairs Dual-pane windows Mature shade trees Fruit trees (lemon, lime) Large laundry/utility room Formal Dining room Formal Living room Separate family room (downstairs) Master Suite (downstairs) Grassy Backyard Finished Side yards Built-in ironing board Remodeled kitchen and baths Soft-close cabinets and drawers Pull out cabinets Spacious main bathroom Industrial heating/air conditioning vents Earthquake bolted New paint Views"},
{"bathrooms_half": "", "date_listed": "2016-09-28 00:00:00", "mls_name": "ITECH", "price": "2400.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "316008990", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Free Standing Gas"], "street_address": "1124 East Chestnut Street #39", "description": "Charming townhouse style condo. Spacious, beautifully maintained light filled two bedroom two bath unit with hardwood floors, fireplace, two balconies, in unit washer/dryer and private two car garage. Appliances include refrigerator, washer/dryer, built in microwave, dish washer. It has been owner occupied so in immaculate condition. HOA rules and regulations. Close to transportation, Glendale Galleria, Americana, easy freeway access. Top floor unit, with stairs for access."},
{"bathrooms_half": "", "date_listed": "2016-09-25 00:00:00", "mls_name": "ITECH", "price": "728000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009006", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Free Standing Gas", "Microwave", "Range Hood"], "street_address": "2454 Oswego Street #201", "description": "Architectural excellence and modern finishes combine seamlessly in this luxurious single level rear unit. Built in 2007, the complex boasts idyllic qualities like lush foliage and curved paver-lined pathways delicately shaded by trees, all of which lead to entrance of the unit. Upon crossing the threshold, one is met by a sizable foyer with beautiful dark wood flooring, guiding you deeper into the space. Large windows flood the open living room--replete with a fireplace--and adjacent kitchen and dining room with natural light and mountain views. This space is conducive to entertaining due to it's effortless flow, inviting layout and it's newness as the unit has been exquisitely maintained. Each of the condos' three well-sized bedroom suites features ample closet space, bathrooms with more-than-agreeable finishings and abundant sunlight. Here, elegance meets comfort and convenience within minutes of shopping, dining, and the Gold Line."},
{"bathrooms_half": "", "date_listed": "2016-09-26 00:00:00", "mls_name": "ITECH", "price": "3695000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316009078", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Convection Oven", "Cooktop - Gas", "Double Oven", "Microwave"], "street_address": "2011 Hall Canyon Drive", "description": "This timeless contemporary Craftsman residence in La Canada, built by C.H. Anderson, was once a grove of deodar pines, transformed into a property fit for entertaining and movement. Renowned architect Marc Whitman, along with award-winning designer Doran Taylor, created spaces that facilitate a free-flowing floor plan which altogether achieve the home's intuitive sense of balance & rhythm. Upon entering through the massive, Torrance steel front door, one's eyes are immediately drawn across the foyer, through the dining room, & beyond. Like a larger-than-life piece of art, the lush backyard is revealed through bi-folding Sierra Pacific doors, evoking indoor/outdoor harmony. Adjacent to the dining room is an impressive great room featuring soaring, vaulted ceilings, a comforting fireplace, and an elevated platform that has served as a musical performance stage on numerous occasions. Rows of clerestory windows throughout enable natural light to pour in while the homes bold timber structure and native stone walls reinforce the home's sturdiness and authenticity. From gatherings held beneath the outdoor canopy, around the saline pool. BBQ or fire pit, this property welcomes all to take advantage of beautiful Southern California weather."},
{"bathrooms_half": "", "date_listed": "2016-09-28 00:00:00", "mls_name": "ITECH", "price": "575000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009157", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas"], "street_address": "247 Crystal Lane", "description": "Beautiful remodeled single family residence at the end of a cul-de-sac. The stunning large kitchen is truly a show stopper with dark custom cabinets including a wine rack, stone counter tops, recessed lights and stainless steel appliances. Large master suite with dual closets and updated en-suite bath. The full hallway bath was also remodeled with a beautiful vanity and nice tile work. Living room offers vaulted ceilings, a fireplace and nice designer carpet. Updated dual pane windows, a good size backyard open to many possibilities and a 2 car garage with direct access are just a few of the many nice features of this home."},
{"bathrooms_half": "", "date_listed": "2016-09-29 13:35:23", "mls_name": "ITECH", "price": "2650.00", "bedrooms": "1", "bathrooms_full": "", "mls_id": "316009232", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "901 South Flower Street #506", "description": "Situated in the vibrant downtown LA South Park area is this live/work light-filled one bedroom gem. It features open floor plan, modern built-in appliances, European cabinets, enclosed bedroom, ample amount of closets and storage space, individual laundry room, large windows framing greenery & city view. It also offer one gated parking space and resort style like amenities such as BBQ grille, spa, heated pool, fitness center, and just minutes away from many popular eateries, stores and attractions, such as Faith and Flower, Broken Spanish, Ralphs, Whole Foods, LA Live, Microsoft center, Regal theatre and more. Come and experience a convenient, comfortable and vibrant living in downtown LA!"},
{"bathrooms_half": "", "date_listed": "2016-10-03 00:00:00", "mls_name": "ITECH", "price": "1339000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009342", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Cooktop - Gas", "Microwave", "Oven"], "street_address": "4842 Alminar Avenue", "description": "Welcome to 4842 Alminar Ave., considered a prime location for many in La Canada! Alminar is a quaint tree lined street not far from schools, shopping and restaurants. This cozy and charming 3 bedroom, 2 bathroom ranch home is reminiscent of days gone by, with original hardwood floors, yet updated with great contemporary amenities. Remodeled kitchen, bathroom and a fenced in pool. Sewers are in, connected and paid. Award winning La Canada schools!"},
{"bathrooms_half": "", "date_listed": "2016-10-04 00:00:00", "mls_name": "ITECH", "price": "549000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009344", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "8258 Owens Street", "description": "Charming traditional home on a nice tree lined street in Sunland. Built in 1953, this 3 bedroom 2 bathroom home has been well maintained and has many recent upgrades including wide plank hardwood floors, newer interior doors, baseboards and casing and a Lutron lighting system! These are just a few things that add to the nuance and character of this special home. This home has a fantastic, livable floor plan with the great room and dining area looking out to the backyard boasting a sparkling pool, spa and outdoor shower! House Highlights: Newer Hardwood Floors, Newer HVAC System (3.5 tons) and Ducting, Complete Copper and Pex Repipe, Newer Drain and Sewer Lines, Upgraded Electrical Panel, Upgraded Electrical Interior, Recessed Lighting, Newer Lutron Lighting system, Newer Interior doors throughout, Remodeled Kitchen and Bathrooms, Granite Counters, Cherry Cabinets, Under Cabinet Lighting, Newer Baseboards and Door Casing, Crown Molding, Dual-pane windows, Mature trees, Master Bedroom , Pool and spa with waterfall, Outdoor shower, Newer Interior paint, Extended Garage"},
{"bathrooms_half": "", "date_listed": "2016-10-07 00:00:00", "mls_name": "ITECH", "price": "2195000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316009356", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Cooktop - Gas", "Double Oven", "Gas Grill", "Range Hood"], "street_address": "4762 La Canada Boulevard", "description": "This stunning 1926 Spanish estate sits on nearly 24,000 square feet of flat land and features a detached 1-BR/1-BA GUEST HOUSE. This house combines original character details with a fantastic floor plan. Formal entry with arched doorway opens to spacious formal Living room with fireplace. Dine in the formal dining room or breakfast area with bay window sitting bench with a views to the back yard. Fireplace in Living Room & Family Room. The spacious Family room offers French doors leading the back yard. Enjoy the spacious Master Suite with balcony patio. The bedrooms are large and feature crown molding and ample closet space. Hardwood floors. Central A/C & Heat. The park-like grounds feature a detached 763 SF 1-BR/ 1-BA guest house with separate entrance and a 226 SF pool house. Experience the California indoor/outdoor entertaining with the sparkling swimming pool and expansive patio. Conveniently close to center of town, Memorial Park and La Canada Elementary School. Connected to public sewers - bond fully paid. In the award-winning La Canada School District. Total square footage (4,731 SF) provided by R.E.S.T. floor plan company and consists of main residence (3,742 SF), Guest House (763 SF), and Pool House (226 SF)."},
{"bathrooms_half": "", "date_listed": "2016-10-03 00:00:00", "mls_name": "ITECH", "price": "1195000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316009368", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "4113 Lanterman Lane", "description": "Beautiful turn-key traditional in La Canada Flintridge. Fantastic floor plan for entertaining with great indoor-outdoor flow. Large living room/ dining room, cooks kitchen and breakfast nook open to the great room. The bedroom wing features 4 bedrooms including the master suite. The back yard has a large patio and lush landscaping. Adjacent to the garage is an additional room, perfect for home office, gym or play space. La Canada Schools."},
{"bathrooms_half": "", "date_listed": "2016-10-07 00:00:00", "mls_name": "ITECH", "price": "799000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "316009501", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "1436 Valane Drive", "description": "A dog-leg left from the first fairway of the Oakmont Country Club is where you will find this hidden, quaint street with friendly neighbors. This single-story, mid Century home has clean lines that are enticing in their subtlety and restraint. The formal entry opens to the living room with hardwood flooring and fireplace. The corner window in the formal dining room allows soft, northwest abundant light. Adjacent is the kitchen and breakfast nook. To complete the home are french doors leading to an additional den that opens out to a verdant patio, perfect for dining al fresco under the twinkling overhead lights. Two lovely bedrooms are adjacent to a large full bath with separate tub and shower. Additionally, there is a half bath, an oversized laundry room and an attached garage. Too many upgrades to list but a few are a new roof installed in 2014, C/A, recessed lighting, insulated/drywalled garage, copper plumbing."},
{"bathrooms_half": "", "date_listed": "2016-10-12 00:00:00", "mls_name": "ITECH", "price": "1195000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009646", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "526 Venado Vista Drive", "description": "This 1957 ranch home is located on a quiet cul-de-sac near Paradise Canyon Elementary School and hiking trails. The home offers a large living/great room with high ceilings, fireplace, built-in cabinets, room for game table and opens to the rear yard. The formal dining room is adjacent to the remodeled kitchen which features high ceilings, custom cabinets, granite counters, built-in wine cooler and opens to the large rear deck, great for indoor outdoor entertaining. The large master bedroom overlooks the rear yard and offers a remodeled bathroom with dual sinks, spa tub and separate shower. There are two other large bedrooms that share a full bathroom. Downstairs is large bonus room that can be used as a family room or potentially remodeled for additional bedrooms. This is truly a wonderful home in great neighborhood!"},
{"bathrooms_half": "", "date_listed": "2016-10-14 00:00:00", "mls_name": "ITECH", "price": "1126000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009693", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Convection Oven", "Cooktop - Gas", "Microwave", "Oven"], "street_address": "1320 Loreto Drive", "description": "Price Reduction! Beautiful 1926 Character Spanish! Located on a peaceful street, this lovely Spanish Colonial is immaculate. Living Room Offers Gleaming Tongue and Groove Hardwood floors and the stately fireplace that anchors the space. The beautiful French doors and windows are the original wood and glass. The updated kitchen is sunny and bright with granite counter tops, custom decorative tile. There is plenty of counter and storage space and a charming day dining room. The Dining Room can accommodate large parties. The den/TV room features a burl wood built in dry bar, plantation shutters and views of the sparkling pool. The grand staircase leads up to two LARGE Bedrooms and an office with built in desk and storage. The Master Bedroom features coved ceiling and an updated en suite. The large guest room features an additional closet/storage space and a romantic Juliette Balcony. Paradise is found in this entertainers private backyard. Swim in the pool, relax in the spa and then shower off in the outdoor shower! Over sized, Immaculate Garage. Security System with Cameras. Exceptional Neighborhood; Nibley Park is down the block. This is the home and price you've been waiting for!!!"},
{"bathrooms_half": "", "date_listed": "2016-10-15 16:59:01", "mls_name": "ITECH", "price": "4000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009737", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "4439 Alta Canyada Road", "description": "Charming 3 BR/ 3 BA home FOR LEASE in the award-winning La Canada Unified School district. The updated kitchen features granite counters and opens to the family room and dining area. Spacious Master BR suite that opens up to the back yard. Wood floors and crown molding through out the house. Two separate A/C controls, a designated laundry closet and dual paned windows. 2-car garage. Conveniently close to Foothill Blvd shopping and transportation."},
{"bathrooms_half": "", "date_listed": "2016-10-17 00:00:00", "mls_name": "ITECH", "price": "599000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "316009746", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Gas", "Oven-Gas"], "street_address": "330 Cordova Street #312", "description": "Just One and half blocks (5 minute walk) from the Metro Gold Line, this heavily-treed urban oasis is conveniently located near restaurants, shopping, art galleries, Old Pasadena, Paseo, South Lake Ave, and the 110, 210, and 134 freeways. This open, bright, 1,600 square foot condo in one of Pasadena's most desirable neighborhood has 2 spacious bedrooms, 2.5 baths, a bonus room for office or studio, 2 fireplaces, 3 private balconies surrounded by trees, abundant closets & storage, wet bar, and large laundry room. Condo has $40,000 in upgrades, including extra-large MERV-16 Lennox HVAC system that filters air 24/7, top appliances, and all rooms having either ceramic tile or natural-oak plank flooring, plus cork sub flooring, and new copper plumbing. Condo has a full-time onsite manager, 2 parking spaces, separate guest-parking garage, pool, spa, fountains, gym, rec room, and elevators. So let the sun shine in, and make this urban oasis your new home. So come and join this wonderful community that has a book club, Friday night dinner parties, and/or yearly Super Bowl Party!"},
{"bathrooms_half": "", "date_listed": "2016-10-19 00:00:00", "mls_name": "ITECH", "price": "355000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "316009753", "rooms": ["bathrooms"], "appliances": ["RangeOven"], "street_address": "385 South Oakland Avenue #105", "description": "Chic studio located on a wonderful tree-lined street in the heart of Pasadena. Well situated in the sophisticated Oakland Towers, this unit features a double door entry, large picture windows with views of the beautiful gardens, newer appliances, modern style lighting, ample closet space and a generous sized bathroom. The gated complex features secured access, assigned carport parking, extra storage, pool and stylish lobby. Within close proximity to Old Town Pasadena, the Playhouse district, South Lake boutiques, the Metro Gold Line, and numerous restaurants and shops."},
{"bathrooms_half": "", "date_listed": "2016-10-18 00:00:00", "mls_name": "ITECH", "price": "1450000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009802", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Gas/Electric Range", "Oven"], "street_address": "5715 Summit Crest Drive", "description": "Beautiful property in desirable La Canada/Flintridge. Charming traditional one story house in a beautiful neighborhood, kitchen with breakfast room and convenient and spacious family room, Banquet sized elegant dining room for easy entertaining. Spacious living room w/ high ceiling and impressive floor-to-ceiling fireplace. Master bedroom located in separate wing with fireplace and grand bathroom, loaded with windows. Located in award winning La Canada School district."},
{"bathrooms_half": "", "date_listed": "2016-10-19 21:51:45", "mls_name": "ITECH", "price": "3500.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316009844", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "277 Atchison Street", "description": "Charming home located on a tree lined street. Great curb appeal, mature trees, backyard porch, hardwood floors, living room with a fireplace, nicely remodeled bathrooms, and kitchen, lots of closet space, formal dining room, private back yard, and a 2 car detached garage. Indoor laundry room with washer and dryer included in the lease. Pets ok."},
{"bathrooms_half": "", "date_listed": "2016-10-21 00:00:00", "mls_name": "ITECH", "price": "598000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "316009913", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "705 East Palm Avenue", "description": "1940's Traditional in desirable NE Monrovia neighborhood within Gold Ribbon School boundry. This 2 bedroom 1 bath home features an open concept living room dining room w/hardwood floors and playroom that opens to the lush backyard with gated swimming pool, fire pit and multiple patio areas making it an entertainers dream. Den/Playroom could be converted to a 3rd bedroom. Upgrades include central air conditioning, newer 30-year roof and extensive landscape and hardscape renovations to the yard. Just blocks from Recreation Park, Bradoaks Elementary School and Clifton Middle School, close to the new Gold Line Station and it's in close proximity to Old Town Monrovia."},
{"bathrooms_half": "", "date_listed": "2016-11-02 00:00:00", "mls_name": "ITECH", "price": "3000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316009971", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Free Standing Gas"], "street_address": "1143 Crowne Drive", "description": "Light-filled 3 bedroom, 2 bath Townhome that feels like a single family residence in great Rose Court neighborhood. This Craftsman style home features beautifully redone hardwood floors in the main living areas and comfortable carpeting in all the bedrooms. A welcoming fireplace in the living room and direct access to the quaint patio create a great space for entertaining. Other features include laundry, a 2-car attached garage with room for storage and a breakfast area off the kitchen. The spacious master bedroom with en-suite renovated bathroom and large walk-in closet is a great space complete with its own balcony for relaxing and ending the day in great fashion. NO PETS PLEASE."},
{"bathrooms_half": "", "date_listed": "2016-10-25 00:00:00", "mls_name": "ITECH", "price": "899000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316010002", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ", "Gas", "Oven-Gas"], "street_address": "2331 North Orchard Drive", "description": "Welcome Home! This beautiful home offers 3 bedrooms, 2 baths with 2004 sq ft of living space. Enjoy gathering in your living room by one of the fireplaces that is connected to the spacious dining area. Or, enjoy the spacious remodeled kitchen that opens to comfortable family room with fireplace and indoor bbq! Beautiful hardwood floors and crown moulding throughout. Kitchen has stainless steel appliances. You will enjoy two patios and a low maintenance backyard complete with gorgeous landscaping and turf grass. Other features include central air and heat, newer roof, spa, and a handymans garage with 220 amp electrical. Burbank schools and services. Move right in!"},
{"bathrooms_half": "", "date_listed": "2016-10-26 00:00:00", "mls_name": "ITECH", "price": "899000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316010040", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "1710 East Mendocino Street", "description": "Nestled in the scenic foothills of the San Gabriel Mountains, this beautifully maintained mid-century ranch is a composition of large, light-filled spacesa generous canvas to make your own. The 9,520-square-foot property sits comfortably within an idyllic tree-lined East Altadena neighborhood, adjacent to Altadena Country Club, a short drive to some of Los Angeles' best hiking trails and set to an awe-inspiring mountain backdrop. Large windows afford an abundance of natural sunlight in the day and two fireplaces provide warmth and comfort by night. Original appliances in the kitchen set the tone for the charming, almost nostalgic 50s character of the home. Step down into the serenity of the patio and swimming pool, enveloped in mature trees and lined with garden beds. This East Altadena home is sure to win over your heart and play a beautiful role in your story."},
{"bathrooms_half": "", "date_listed": "2016-10-27 12:33:34", "mls_name": "ITECH", "price": "1895000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010077", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "1121 Hillcroft Road", "description": "This sensational 1927 Spanish Colonial, revived to perfection, stands proudest among the other notable properties in this most coveted location of Rossmoyne Historic District. Rossmoyne is one of Glendale's most interesting historic neighborhoods, rich with some of the finest residential architecture. The gracious, formal entry and center hall have beautiful architectural details and opens to the formal step-down living room with adjacent den (both with fireplaces), the formal living room and to the newly expanded kitchen w/ walk-in wine room, family room with fireplace, office and guest bathroom. Every room exudes unique grandness with period detailing. To complete this home, there are two master suites with brilliantly remodeled bathrooms and two additional bedrooms and bathroom on the upper floor. Verdant views across the canyon to the San Gabriel Mountains are enjoyed while dining on the spacious patio or enjoy the stone pathways & walls to the lower level. This home is captivating and elegant!"},
{"bathrooms_half": "", "date_listed": "2016-10-28 00:00:00", "mls_name": "ITECH", "price": "1699000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010117", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "370 South Berkeley Avenue", "description": "Nothing defines Southern California real estate like the understated elegance of a two-story Spanish Revival home. Located in the prestigious Cal Tech area of Pasadena, with San Marino just a block away, the surrounding homes and tree-lined streets are reminiscent of a bygone era. Yet, what makes this property extra special, is the extensive restoration which this home has undergone. With an eye for detail and an insistence on quality, the owners have overseen the following: New roof using original clay tiles - Copper flashings and rain gutters - Central heat & air conditioning - Original windows and hardware restored - Copper re-plumbing - Refinished hardwood floors - Kitchen remodel with furniture-grade custom cabinetry - Carrera marble and Mahogany counters - Viking appliances and Asko Dishwasher - 3 remodeled baths with period tile work - Recessed lighting with push-button dimmers - French drain installed - Connected to public sewer. Features include four bedrooms, three baths, Living room with vaulted, open- beamed ceiling, formal dining room, family room and formal entry. Outside, you will find a charming courtyard, rear patio and lawn area, gated driveway and a two-car garage."},
{"bathrooms_half": "", "date_listed": "2016-11-01 00:00:00", "mls_name": "ITECH", "price": "1998000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316010138", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas", "Double Oven", "Range Hood"], "street_address": "929 Old Mill Road", "description": "This modern contemporary home resides on a corner lot in the upscale Langham Area of Pasadena, a neighborhood characterized by rolling, oak-covered terrain on the base of the picturesque San Gabriel Mountains. The beautifully landscaped yard, which includes a zen garden with mature bamboo, water features, bbq, and distinct patios, is further accentuated by several pergolas that truly function as an extension of the 3,171 sq. ft. home. Adjacent to the large, updated kitchen with island breakfast bar is a living room area distinguished by 9 ft. plus ceilings and a free-standing fireplace. The second floor houses the luxurious master suite, a retreat in and of itself featuring a spacious, wooden walk-in closet and immaculate bathroom with glass-encased shower. Centrally located to thriving downtown Pasadena, as well as the prime streets of San Marino, this residence is also a stone's throw away from the iconic Langham Huntington, a luxury resort hotel that dates back to the Gilded Age."},
{"bathrooms_half": "", "date_listed": "2016-10-31 00:00:00", "mls_name": "ITECH", "price": "3950.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010184", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "3263 Orlando Road", "description": "San Marino Schools! Located in a quiet cul de sac, this traditional single story ranch home has 4 bedrooms and 3.5 bath including permitted guest house ( approx.545 sqft) in San Marino school district. Huge and bright living room, spacious dining room and especially expansively large family room are perfect for a big family. Large master suite includes full bathroom, closet and sliding door to back yard. There is also a guest house right behind carport and covered patio structure with built in bbq and cabinetry for outdoor lifestyle. All three bedrooms are carpeted and hardwood floors throughout the house. Pets are allowed and short term lease available."},
{"bathrooms_half": "", "date_listed": "2016-11-02 11:55:26", "mls_name": "ITECH", "price": "2485000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010241", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Free Standing Gas", "Oven-Gas"], "street_address": "555 Sierra Madre Boulevard", "description": "Located in the desirable city of San Marino, near the prestigious Huntington Library, perched up and set back from the street, is this 4 bedrooms 4 baths whimsical traditional. It has been extensively remodeled and upgraded from the infrastructure, to the interior and exterior. Three spacious bedroom suites downstairs and one master retreat upstairs. Entertain in the formal dinning under the new chandelier, or in the sitting area for a game of cards and a cocktail, or watch a movie in the cozy relaxing family room. Newly designed landscape with various trees and flowers planted throughout the front, side and backyards. Two back patios perfect for BBQ and afternoon teas anytime of the year."},
{"bathrooms_half": "", "date_listed": "2016-11-03 07:20:11", "mls_name": "ITECH", "price": "608000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316010261", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Cooktop - Gas", "Oven"], "street_address": "265 West California Boulevard #8", "description": "Fantastic three bedroom townhome located in Cal Ritz-Park complex across from Singer Park. Conveniently located close to Old Town, Rose Parade route, Huntington Hospital. This unit is bright and light and is located at the back of the complex. Bright kitchen has a pass-through to the dining area which offers laminate flooring expanding through the living room. Recessed lights and a fireplace complete the living space which opens out to the large and private patio and yard. Master bedroom features vaulted ceiling, walk-in closet, private balcony & dual vanity in the master bath 2 additional good size bedrooms are located upstairs as well as a bath. Additional features include skylight in upstairs stairwell, coat closet & plenty of storage space. Downstairs room with laundry area and water heater connects to private 2 car garage. Association amenities include secured access & gated parking."},
{"bathrooms_half": "", "date_listed": "2016-11-03 00:00:00", "mls_name": "ITECH", "price": "150000.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "316010267", "rooms": [], "appliances": [], "street_address": "0 Roselawn", "description": "Great Opportunity! Buyer needs to check with City of Glendale and LA County Flood Control for possible specific uses of this property. Plans drawn in 2005 are available for viewing."},
{"bathrooms_half": "", "date_listed": "2016-11-05 06:16:15", "mls_name": "ITECH", "price": "540000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316010316", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas"], "street_address": "766 Elmira Street", "description": "Charming, updated (approx 4 years ago) Spanish-style single family framed by lovely landscaping. Truly move-in ready. Centrally located, close to shopping, with easy freeway access. The remodeled kitchen and baths feature travertine tile, granite counter tops, dark walnut-stained cabinetry, brushed antique bronze fixtures, glass-tile backsplashes, ceiling fans, newer windows, plus stainless steel kitchen appliances including oven, dishwasher & microwave. The dining area and hallway receive extra natural light from the skylight. Freshly painted interior, laminate wood floors in 2 bedrooms, the 3rd newer carpet, Central A/C. Separate laundry room provides cabinets for linens and storage. Separate two-car garage, additional parking in both the driveway and in front. Intimate private patio."},
{"bathrooms_half": "", "date_listed": "2016-11-07 00:00:00", "mls_name": "ITECH", "price": "5000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316010376", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas", "Cooktop - Gas", "Microwave", "Oven"], "street_address": "560 Chaparral Court", "description": "Set against the backdrop of the majestic San Gabriel Mountains, this beautiful single-level Spainsh home rests behind the gates of La Vina in Altadena. Enter through the lush courtyard to the front door; the vaulted entryway invites you in to the light-filled formal living and dining rooms. A chef's kitchen with a large island and ample cabinet space overlooks the rear garden. Just off the kitchen is the family room complete with built-in entertainment center and welcoming fireplace. The home offers two separate wings of living space. In one bedroom wing, the spacious master suite features two walk-in closets, large master bath and an office/small sitting room. In the other wing are two bedrooms with a shared full bathroom. With mature landscaping, the home draws you outside to the grapevine arbor and the al fresco dining area. Fountains, native plantings and a dry stone riverbed accent the landscape with views of the city lights at night."},
{"bathrooms_half": "", "date_listed": "2016-11-10 00:00:00", "mls_name": "ITECH", "price": "650000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "316010426", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "391 West Harriet Street", "description": "Wonderful traditional 3 bedrooms, 2 bathrooms home located in Altadena. Granite counter-tops in the kitchen and baths, newer cabinets throughout. Light and bright living room with fireplace, formal dining room, open eat-in kitchen leads to great room with French doors to the covered patio and expansive yard. Master suite with its own bath. 2 bedrooms share a hall bath. Security system, central heat and air, pull through garage. Beautiful mountain views and easy access to the 210 freeway."},
{"bathrooms_half": "", "date_listed": "2016-11-09 00:00:00", "mls_name": "ITECH", "price": "2175000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "316010451", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "2079 Skyview Drive", "description": "A dramatic backdrop of the San Gabriel Mountains and mature scenery frames the magnificent setting for this superb Mediterranean revival located in Altadena's premier estate area. Home to a celebrity musician since 2007, this 1940's property was rebuilt and designed in 2005 by Franco Noravian, AIA. Blending old world charm with modern amenities, thoughtful attention to quality finishes are showcased by rich hardwood floors, deep crown moldings and wainscoting. The two-story entry welcomes you to a practical floor plan featuring a grand staircase, formal living room with box-beamed ceiling and an open concept fireplace with the adjoining formal dining room. The gourmet kitchen includes a breakfast nook with built-in seating, large pantry, built-in desk, and island. The kitchen opens to a family room with soaring ceilings, fireplace, wet bar and a large entertainment center with surround sound. French doors lead to a delightful patio with arbor and paver tile and a large rear yard. The home offers a total of 5 bedrooms plus a 6th that has been transformed into a massive closet with built-ins. 2 bedrooms are featured downstairs, each with dedicated baths. Additionally, there is a separate library office handsomely adorned with wood wainscoting."},
{"bathrooms_half": "", "date_listed": "2016-11-11 00:00:00", "mls_name": "ITECH", "price": "1150000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010501", "rooms": ["bedrooms", "bathrooms"], "appliances": [], "street_address": "3301 Vickers Drive", "description": "Beautiful one owner home in prime Montecito Park location. This single story residence features 4 bedrooms, 2.5 baths. New wood flooring throughout most of the house. Spacious master suite with ample closet space and master bath. Kitchen opens to dining room and expansive great room. Vintage rock fireplaces in great room and living room. Open floor plan with abundant windows and glass doors make this home perfect for indoor/outdoor living. Close to Fremont Elementary and the shops and restaurants on Honolulu. La Crescenta Schools."},
{"bathrooms_half": "", "date_listed": "2016-11-13 00:00:00", "mls_name": "ITECH", "price": "569900.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010528", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Oven"], "street_address": "27815 Zion Court", "description": "Beautiful Hillcrest home for sale with 4 bedrooms (1 downstairs) and 3 baths. Upon entering you will be greeted with a beautiful living room with high ceilings along with dining area. Enjoy entertaining in your updated kitchen that opens to spacious family room with fireplace and doors to the backyard. The backyard is spacious and private. Three bedrooms and extra play area make the upstairs a wonderful addition to this amazing home. New plantation shutters on dual paned windows, quartz kitchen counter and stunning wrought iron staircase are some of features. House is on cul- de-sac and has NO HOA or MELLO ROOS! All you need to do is bring your toothbrush and start enjoying this beautiful home."},
{"bathrooms_half": "", "date_listed": "2016-11-14 00:00:00", "mls_name": "ITECH", "price": "2600000.00", "bedrooms": "5", "bathrooms_full": "", "mls_id": "316010536", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In BBQ"], "street_address": "5042 Indianola Way", "description": "5042 Indianola Way is a one of a kind property, located on a desirable cul-de-sac in La Canada Flintridge, close to Paradise Canyon Elementary and town. This handsome single story traditional home features 3,645 sq. ft. of living space, 5 bedrooms and 4 baths, including spectacular master suite with vaulted ceilings and luxurious master bath. A lovely entry opens to large living room and family room sharing a back to back fireplace, adjacent to formal dining room. The custom kitchen includes maple cabinets, granite counters and center island serving as breakfast area. Additional features include a circular driveway, attached 2 car garage plus large laundry/service room off kitchen. Sliding glass doors from family room, living room and master suite open onto expansive patio overlooking deep yard with pool, sprawling lawn, play house, built in BBQ and several fruit trees surrounded by mature landscaping. The magnificent 20,000+ sq. ft. flat lot offers a peaceful setting as a private haven."},
{"bathrooms_half": "", "date_listed": "2016-11-18 00:00:00", "mls_name": "ITECH", "price": "785000.00", "bedrooms": "2", "bathrooms_full": "", "mls_id": "316010634", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-Ins", "Microwave", "Oven", "RangeOven", "Range Hood"], "street_address": "574 Garfield Avenue", "description": "Located in the prestigious and desirable Franciscan Woods. This tri-level townhouse is exceptional in every aspect. The newly built front deck is ideal for relaxing and entertaining with amazing views of gorgeous mature trees. Formal living room is open and spacious with hardwood floors, plantation shutters and custom fireplace. Middle level includes dining area with a built-in window seat. The den is adjacent to the picturesque light and bright kitchen with newer stainless steel appliances, large pantry and breakfast bar. Third level offers expansive master suite with cathedral ceilings, custom closets and updated bathroom. Second en-suite with ample closet space and large full bath. Move right in to this unit. It has been well maintained and great location in the complex. This truly is a lovely home close to schools, parks, shopping and restaurants."},
{"bathrooms_half": "", "date_listed": "2016-11-17 00:00:00", "mls_name": "ITECH", "price": "1299000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010650", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas"], "street_address": "20280 Allentown Drive", "description": "Nestled on a breathtaking secluded lot in the esteemed Vista De Oro neighborhood, this completely re-imagined mid-century home marries pristine contemporary features with luxury amenities that wash away the concerns of the day. Light gray oak floors stretch from the foyer and living room, through a tasteful den/office and lead to a stunning cook's kitchen, overlooking a huge swimming pool and mountain views with a smattering of city lights. A grassy side yard with fire-pit and nearly 2,000 sq ft of patio space is a playground for the most demanding entertainer, all situated with the utmost seclusion. Retreat to the outdoor sauna for respite and renewal or retire to the master suite complete with soaking tub and huge luxurious double shower. The far side of the home features three additional bedrooms, and two remodeled bathrooms, offering enough space for the entire family. The home also features an extra large 2 car garage and driveway. This quiet and tranquil south of the boulevard property is truly a gateway to resort living."},
{"bathrooms_half": "", "date_listed": "2016-11-18 07:45:06", "mls_name": "ITECH", "price": "1025000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "316010702", "rooms": ["bedrooms", "bathrooms"], "appliances": ["Built-In Gas"], "street_address": "545 Westgate Street", "description": "ALARM IS ON.Two-story Victorian home with an inviting wraparound porch and lots of character throughout and many nice upgrades including copper plumbing, updated electrical and central air. Large living room with wood burning fireplace and 13' ceilings. Bright and updated gourmet kitchen with modern stone countertops, Wedgewood stove, spacious peninsula for casual dining, coffered ceilings and walls of windows that allows great light in and a beautiful view of the yard. On the first floor are also located a grand dining room and a roomy bedroom with an adjacent updated full bath that includes a claw foot tub and separate shower. Up the stairs you are greeted by a sitting area that overlooks the San Gabriel Mountains, 3 bedrooms, a laundry room equipped with washer and dryer, and a bath. Outside, there are two patio areas and a nicely landscaped yard with hedges, roses & a variety of trees. This home is conveniently located near the Rose Bowl and Old Town Pasadena. Two car detached garage also offers tons of storage, a work bench and a gated concrete driveway for privacy. Could be eligible for the Mills Act, buyer to investigate."},
{"bathrooms_half": "", "date_listed": "2014-07-24 16:33:10", "mls_name": "partnerstrust", "price": "50000.00", "bedrooms": "4", "bathrooms_full": "", "mls_id": "PT2979", "rooms": ["bedrooms"], "appliances": [], "street_address": "30810 Broad Beach Road", "description": "<p>This Chic Cape Cod home with guest house is located on the sand with a private grassy yard, open terrace, built-in spa, barbeque area, fire pit and access to beach. Wonderful accommodations for guests and entertaining. Separate guest house with living room, kitchen, bedroom and bath. Main house 4 bedrooms, 4 baths, and light filled spacious rooms throughout. Available for summer months, please call for rates.</p>"},
{"bathrooms_half": "", "date_listed": "2015-02-13 14:29:51", "mls_name": "partnerstrust", "price": "999990.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "PT3446", "rooms": [], "appliances": [], "street_address": "0 Encinal Canyon", "description": "<p>Extraordinarily beautiful pastoral acreage with amazing ocean and Catalina views. It is rare to find this much useable land in the Santa Monica mountains in a setting that only Encinal Canyon can provide. Peaceful and serene, this is an ideal spot for a large estate or ranch with Charmalee Park and riding trails next door. The elevated location allows for unobstructable ocean views. Feel the gentle breezes off the ocean as you enjoy viewing Catalina Island from your new compound in Malibu. Just heaven. Offering includes APN #4472-028-040 and 4472-028-039.</p>"},
{"bathrooms_half": "", "date_listed": "2015-02-27 09:00:55", "mls_name": "partnerstrust", "price": "3700.00", "bedrooms": "0", "bathrooms_full": "", "mls_id": "PT3481", "rooms": [], "appliances": [], "street_address": "13320 Beach Avenue #307", "description": "<p>Location, location, location! Fabulous loft w over 1200 square ft of living space. This loft has top quality brand name fixtures &amp; appliances, w careful attention paid to quality, detailing &amp; finishes. The kitchen is a part of the great room, which makes it easily accessible and open to natural light. This open floor plan gives you ample room for great cooking and entertaining. 2 car parking, balcony and w/d hookups make this the perfect place to call home. Walk to fabulous restaurants and shops. Hurry this will not last!</p>"},
{"bathrooms_half": "", "date_listed": "2016-10-04 00:00:00", "mls_name": "CRMLS", "price": "779000.00", "bedrooms": "3", "bathrooms_full": "", "mls_id": "SB16712658MR", "rooms": ["bedrooms", "bathrooms"], "appliances": ["RangeOven"], "street_address": "1110 Felbar Avenue", "description": "A decorator perfect home in Torrance Gardens awaits: enter this 1,611 sq. ft. gem from a welcoming brick front porch, step into the inviting living room with beautiful wood floors, and take your time in the large, beautiful family room before you step through French doors to a very private and sunny rear yard with flagstone patio. The stunning updated kitchen features quartz counters, a granite sink, lots of storage areas and stainless appliances. The roomy master suite accommodates a CalKing bed, has a large walk-in closet, and offers a soothing master bath surrounded by glass tiles, offers dual vanities and, again, plenty of storage. A total of 3 bedrooms and 2 baths, with features like crown molding, wood floors, LED lighting in ceilings, ceiling fans, plantation shutters, new interior doors, updated forced air heating and newer windows make this home absolutely move in ready. Want more? How about plenty of parking behind the gated driveway leading to the 2 car detached garage. Refrigerator, washer and dryer included. Yes, there is more. Come and see this wonderful home SOON!"}
]